#pragma once
#include "PPUOpcodes.h"

class PPUThread;

union ppu_opcode_t
{
	u32 opcode;

	struct
	{
		u32 rc    : 1; // 31
		u32 shh   : 1; // 30
		u32       : 3; // 27..29
		u32 mbmeh : 1; // 26
		u32 mbmel : 5; // 21..25
		u32 shl   : 5; // 16..20
		u32 vuimm : 5; // 11..15
		u32 vs    : 5; // 6..10
		u32       : 6;
	};

	struct
	{
		u32     : 6;  // 26..31
	    u32 vsh : 4;  // 22..25
		u32 oe  : 1;  // 21
		u32 spr : 10; // 11..20
		u32     : 11;
	};

	struct
	{
		u32    : 6; // 26..31
		u32 vc : 5; // 21..25
		u32 vb : 5; // 16..20
		u32 va : 5; // 11..15
		u32 vd : 5; // 6..10
		u32    : 6;
	};

	struct
	{
		u32 lk : 1; // 31
		u32 aa : 1; // 30
		u32    : 4; // 26..29
		u32    : 5; // 21..25
		u32 rb : 5; // 16..20
		u32 ra : 5; // 11..15
		u32 rd : 5; // 6..10
		u32    : 6;
	};

	struct
	{
		u32 uimm16 : 16; // 16..31
		u32        : 4;  // 12..15
		u32 l11    : 1;  // 11
		u32 rs     : 5;  // 6..10
		u32        : 6;
	};

	struct
	{
		s32 simm16 : 16; // 16..31
		s32 vsimm  : 5;  // 11..15
		s32        : 11;
	};

	struct
	{
		s32 ll : 26; // 6..31
		s32    : 6;
	};

	struct
	{
	    u32      : 5; // 27..31
	    u32 lev  : 7; // 20..26
		u32 i    : 4; // 16..19
		u32      : 2; // 14..15
		u32 crfs : 3; // 11..13
		u32 l10  : 1; // 10
		u32      : 1; // 9
		u32 crfd : 3; // 6..8
		u32      : 6;
	};

	struct
	{
		u32      : 1; // 31
		u32      : 1; // 30
		u32      : 4; // 26..29
		u32      : 5; // 21..25
		u32 crbb : 5; // 16..20
		u32 crba : 5; // 11..15
		u32 crbd : 5; // 6..10
		u32      : 6;
	};

	struct
	{
		u32 rc : 1; // 31
		u32 me : 5; // 26..30
		u32 mb : 5; // 21..25
		u32 sh : 5; // 16..20
		u32 bi : 5; // 11..15
		u32 bo : 5; // 6..10
		u32    : 6;
	};

	struct
	{
		u32     : 6; // 26..31
		u32 frc : 5; // 21..25
		u32 frb : 5; // 16..20
		u32 fra : 5; // 11..15
		u32 frd : 5; // 6..10
		u32     : 6;
	};

	struct
	{
		u32     : 12; // 20..31
		u32 crm : 8;  // 12..19
		u32     : 1;  // 11
		u32 frs : 5;  // 6..10
		u32     : 6;
	};

	struct
	{
		u32     : 17; // 15..31
		u32 flm : 8;  // 7..14
		u32     : 7;
	};
};

using ppu_inter_func_t = void(*)(PPUThread& CPU, ppu_opcode_t opcode);

namespace ppu_interpreter
{
	void NULL_OP(PPUThread& CPU, ppu_opcode_t op);
	void NOP(PPUThread& CPU, ppu_opcode_t op);

	void TDI(PPUThread& CPU, ppu_opcode_t op);
	void TWI(PPUThread& CPU, ppu_opcode_t op);

	void MFVSCR(PPUThread& CPU, ppu_opcode_t op);
	void MTVSCR(PPUThread& CPU, ppu_opcode_t op);
	void VADDCUW(PPUThread& CPU, ppu_opcode_t op);
	void VADDFP(PPUThread& CPU, ppu_opcode_t op);
	void VADDSBS(PPUThread& CPU, ppu_opcode_t op);
	void VADDSHS(PPUThread& CPU, ppu_opcode_t op);
	void VADDSWS(PPUThread& CPU, ppu_opcode_t op);
	void VADDUBM(PPUThread& CPU, ppu_opcode_t op);
	void VADDUBS(PPUThread& CPU, ppu_opcode_t op);
	void VADDUHM(PPUThread& CPU, ppu_opcode_t op);
	void VADDUHS(PPUThread& CPU, ppu_opcode_t op);
