#include "stdafx.h"
#include "Emu/System.h"
#include "Emu/IdManager.h"
#include "Emu/Cell/PPUModule.h"
#include "Emu/Cell/lv2/sys_mutex.h"
#include "Emu/Cell/lv2/sys_cond.h"

#include "cellSysutil.h"

#include "Utilities/StrUtil.h"

#include <mutex>
#include <queue>

logs::channel cellSysutil("cellSysutil");

using CXmlAllocator = void(u32 allocType, vm::ptr<void> userData, vm::ptr<void> oldAddr, u32 requiredSize, vm::ptr<void> addr, vm::ptr<u32> size);

enum Cxml_AllocationType
{
    AllocationType_Alloc_Tree,
    AllocationType_Alloc_IDTable,
    AllocationType_Alloc_StringTable,
    AllocationType_Alloc_IntArrayTable,
    AllocationType_Alloc_FloatArrayTable,
    AllocationType_Alloc_FileTable,

    AllocationType_Free_Tree,
    AllocationType_Free_IDTable,
    AllocationType_Free_StringTable,
    AllocationType_Free_IntArrayTable,
    AllocationType_Free_FloatArrayTable,
    AllocationType_Free_FileTable,
};

enum AccessMode
{
    AccessMode_ReadWrite,
    AccessMode_ReadOnly_File,
    AccessMode_ReadOnly_Memory,
};

struct cxml_document
{
    be_t<u32> accessMode;                 // 0x00
    struct Header {
        char magic[4];                    // 0x04
        be_t<u32> version;                // 0x08
        be_t<u32> tree_offset;            // 0x0C
        be_t<u32> tree_size;              // 0x10
        be_t<u32> idtable_offset;         // 0x14
        be_t<u32> idtable_size;           // 0x18
        be_t<u32> stringtable_offset;     // 0x1C
        be_t<u32> stringtable_size;       // 0x20
        be_t<u32> intarraytable_offset;   // 0x24
        be_t<u32> intarraytable_size;     // 0x28
        be_t<u32> floatarraytable_offset; // 0x2C
        be_t<u32> floatarraytable_size;   // 0x30
        be_t<u32> filetable_offset;       // 0x34
        be_t<u32> filetable_size;         // 0x38
    } header;

    vm::bptr<u8> tree;               // 0x3C
    be_t<u32> tree_capacity;           // 0x40
    vm::bptr<u8> idtable;            // 0x44
    be_t<u32> idtable_capacity;        // 0x48
    vm::bptr<char> stringtable;        // 0x4C
    be_t<u32> stringtable_capacity;    // 0x50
    vm::bptr<u32> intarraytable;       // 0x54
    be_t<u32> intarraytable_capacity;  // 0x58
    vm::bptr<f32> floatarraytable;   // 0x5C
    be_t<u32> floatarraytable_capacity;// 0x60
    vm::bptr<u8> filetable;          // 0x64
    be_t<u32> filetable_capacity;      // 0x68
    vm::bptr<CXmlAllocator> allocator; // 0x6C
    vm::bptr<void> allocator_userdata; // 0x70
};

static_assert(sizeof(cxml_document) == 0x74, "Invalid CXml doc size!");

static_assert(sizeof(cxml_document::Header) == 0x38, "Invalid CXml header size!");

struct cxml_element
{
    vm::bptr<cxml_document> doc;
    be_t<u32> offset;
};

struct cxml_attribute
{
    vm::bptr<cxml_document> doc;
    be_t<u32> element_offset;
    be_t<u32> offset;
};

struct cxml_childelement_bin
{
    be_t<s32> name;        // 0x00
    be_t<s32> attr_num;    // 0x04
    be_t<s32> parent;      // 0x08
    be_t<s32> prev;        // 0x0C
    be_t<s32> next;        // 0x10
    be_t<s32> first_child; // 0x14
    be_t<s32> last_child;  // 0x18
};

static_assert(sizeof(cxml_childelement_bin) == 0x1C, "Invalid CXml child element bin size!");

struct SysutilPacketInfo {
    be_t<u32> slot;
    be_t<u32> evnt;
    be_t<u32> size;
};

// these structs are awful and im not sure exactly if they are right, but im just going with it

struct SysutilSharedMemInfo {
    be_t<u32> unk1;         // 0x00 // 0x400 default, some sort of offset between..packet headers?
    be_t<u32> size;         // 0x04 // 0x7C00 hardset ... probly should allocate this somewhere
    be_t<u32> unk3;         // 0x08 // only changes during 'write' pending maybe?
    be_t<u32> unk4;         // 0x0C // only changes during 'read'
    be_t<u32> bytesWritten; // 0x10 
    be_t<u32> unk6;         // 0x14 //status?
    be_t<u32> unk7;         // 0x18
    u8 unk8;                // 0x1C // event is 0? and in use
    u8 packetInUse;         // 0x1D // packet in use for non 0 event?
    u8 unk9;                // 0x1E // 0? this might just be an abort flag
    u8 unk10;               // 0x1F
};

static_assert(sizeof(SysutilSharedMemInfo) == 0x20, "Invalid SysutilSharedMemInfo size");

struct SysutilSlotSync {
    vm::bptr<SysutilSharedMemInfo> sharedMemInfo; // 0x0
    be_t<u32> shm_mutex{ 0 }; // 0x4
    be_t<u32> nem_cond{ 0 }; // 0x8 
    be_t<u32> nfl_cond{ 0 }; // 0xC
    be_t<u32> stf_cond{ 0 }; // 0x10
    be_t<u32> ctf_cond{ 0 }; // 0x14
    be_t<s32> evnt{ -1 };    //  0x18
    be_t<u32> sharedAddr{ 0 }; // ??? this doesnt go here but i dont know where else to put it...
};

//static_assert(sizeof(SysutilSlotSync) == 0x18, "Invalid SysutilSlotSync size");

class sysutil_service_manager final : public named_thread
{
    void on_task() override;

    std::string get_name() const override { return "Sysutil Service Manager"; }

    u32 internalPacketRead();

    vm::ptr<char> internalCxmlBuffer = vm::null;
    vm::ptr<cxml_document> internalCxmlDoc = vm::null;
    vm::ptr<cxml_attribute> internalCxmlAttr = vm::null;
    vm::ptr<cxml_element> internalCxmlElement = vm::null;

    std::shared_ptr<ppu_thread> internalThread;

public:
    // packet stuff may want to be vm::gvar instead 
