Repository: RPCS3/rpcs3
Catalog: locales/*/pcsx2_Iconized.po
Languages: es_es, it_it, ja_jp, pl_pl, ru_ru, sv_se, th_th, zh_tw

source: This hack works best for games that use the INTC Status register to wait for vsyncs, which includes primarily non-3D RPG titles. Games that do not use this method of vsync will see little or no speedup from this hack.
es_es: Este arreglo funciona mejor en juegos que utilizan el registro de estado INTC para esperar a la sincronía vertical, que incluyen principalmente a los RPGs que no son 3D. Los juegos que no utilizan este método de sincronía vertical no recibirán aumentos de velocidad con este arreglo.
it_it: Questo hack funziona al meglio nei giochi che utilizzano il registro di Stato INTC per attendere la sincronia verticale, principalmente i GdR non in 3D. I giochi che non utilizzano questo metodo di sincronia verticale otterranno un aumento di velocità minimo se non nullo.
ja_jp: 垂直同期を待つ為にINTCステータスレジスタを使用する、主に非3D RPGゲームで使うと効果が得られます。 この手法を使用しないゲームでは、速度向上はわずかです。
pl_pl: Ta łatka działa najlepiej z grami, które używają zapisu stanu INTC do oczekiwania na synchronizację pionową, głównie wszelkie nie zrobione w 3D RPGi. Inne gry nie będą miały z tego żadnego, lub minimalny pożytek.
ru_ru: Данный хак лучше всего применять для игр которые используют регистрацию статуса INTC при ожидании вертикального синхроимпульса. В основном это RPG, не использующие 3D. Все остальные игры либо не получат никакого ускорения, либо оно будет чрезвычайно мало.
sv_se: Denna fix fungerar bäst för spel som använder INTC-statusregistret för att invänta Vsync'ar, vilket främst omfattar icke-3D-RPG titlar. Spel som inte använder denna Vsync-metod kommer på sin höjd att få en Liten uppsnabbning.
th_th: แฮ็คนี้ทำงานได้ดีที่สุดสำหรับเกมที่ใช้การลงทะเบียน INTC Status เพื่อรอ vsyncs ซึ่งรวมถึงแนว RPG non-3D โดยส่วนมาก เกมที่ไม่ใช้วิธีการนี้ของ vsync จะเห็นความเร็วไม่เพิ่มขึ้นหรือเพิ่มเล็กน้อยจากแฮ็คนี้
zh_tw: 對於使用 INTC 狀態暫存器等待垂直同步的遊戲，表現最好。 主要包括 RPG 遊戲非 3D 的標題。 不使用此垂直同步方式的遊戲，將會有少量或沒有速度提升。

source: Primarily targetting the EE idle loop at address 0x81FC0 in the kernel, this hack attempts to detect loops whose bodies are guaranteed to result in the same machine state for every iteration until a scheduled event triggers emulation of another unit. After a single iteration of such loops, we advance to the time of the next event or the end of the processor's timeslice, whichever comes first.
es_es: Al apuntar directamente al bucle de espera del EE en la dirección 0x81FC0 del kernel, este arreglo intenta localizar bucles cuyos cuerpos demuestran tener el mismo estado de la máquina en cada iteración hasta que un evento prefijado activa la emulación de otra unidad. Tras una iteración de tales bucles, aumentamos el tiempo del siguiente evento o el final del espacio de tiempo del procesador, en función de lo que llegue primero."
it_it: L'obiettivo principale è l'idle loop (ciclo per inattività) dell'EE nell'indirizzo 0x81FC0 nel kernel ; questo hack prova a rilevare i cicli i cui corpi mantengono uno stato macchina uguale per ogni iterazione fino a quando un evento scatena l'emulazione di un'altra unità. Dopo una sola iterazione di questo tipo di ciclo, l'elaborazione passa all'evento successivo o alla fine del tempo riservato al processore, quale venga prima.
ja_jp: カーネルの 0x81FC0 アドレスにあるEEアイドルループを主に監視し、別ユニットのエミュレーションが発動するイベントまで、 全ての反復でマシンステートが同一である保証があるループの探知を試みます。検出ループに対し１度の反復後に次のイベントへ、 若しくはプロセッサのタイムスライスの末尾へ、どちらか近いほうへ飛びます。
pl_pl: Ta łatka namierza bezczynne pętle o adresie 0x81FC0 w jądrze EE. Stara się wykryć pętle, które gwarantują powtarzanie tych samych wartości aż do pewnego zdarzenia i odtwarza je dopiero gdy to zdarzenie nastąpi.
ru_ru: Изначально нацеленный на пустые циклы EE-рекомпилятора по адресу ядра 0x81FC0, данный хак пытается определить циклы, результат работы которых (после каждой последующей итерации) никак не скажется на текущем состоянии машины до тех пор, пока запланированое событие не запустит эмуляцию другого юнита. После первой итерации таких "пустых" циклов, мы просто переходим к следующему событию или вообще к концу процессорного интервала.
sv_se: Främst inriktat på EE-tomgångsloop hos adress 0x81FC0 i kärnan, försöker denna fix att upptäcka loopar vars kroppar garanterat medför samma maskintillstånd vid varje upprepning tills en schemalagd händelse utlöser emulering av en annan enhet. Efter en enskild upprepning av en sådan loop, avancerar Vi till tiden för nästa händelse eller till slutet av processorns tidskvantum, vilket som än kommer först.
th_th: เริ่มแรกพุ่งเป้าไปยัง EE idle loop ที่ตำแหน่ง 0x81FC0 ใน kernel, แฮ็คนี้พยายาม ตรวจจับ loop ที่มีการการันตีส่วนหลัก เพื่อส่งผลให้เกิดสถานภาพเครื่องเหมือนเดิมในทุก ๆ การทำซ้ำ จนกระทั่งเหตุการณ์ที่ลำดับไว้กระตุ้นการจำลองของหน่วยอื่น หลังจากการทำซ้ำ ๆ ของ loop นั้น เราก้าวไปสู่เวลาของเหตุการณ์ถัดไปหรือจุดสิ้นสุดของตัวแบ่งเวลาของตัวประมวลผล, อันไหนก็ตามที่มาก่อน
zh_tw: 主要把核心內位址 0x81FC0 的 EE 空閒循環作為目標。 嘗試偵測每次重複都確保導致相同機器狀態的循環， 直到一個排定的事件觸發另一個單元的模擬。 這樣的循環重複一次之後，取決於哪個先到： 我們前進到下次事件或處理器時間片段的結束。

source: Check HDLoader compatibility lists for known games that have issues with this. (Often marked as needing 'mode 1' or 'slow DVD'
es_es: Comprueba las listas de compatibilidad del HDLoader para saber qué juegos tienen problemas con esta opción. (Generalmente marcadas como 'modo 1' o 'DVD lento').
it_it: Controlla la lista compatibilità di HDLoader per sapere quali giochi creano problemi con questo SpeedHack. (spesso indicati con 'mode 1' o 'slow DVD' necessario)
ja_jp: 「HDLoader compatibility list」を参照し、この機能を《使用できない》ゲームを調べて下さい（mode 1/slow DVDと表記されています）。
pl_pl: Sprawdź listę kompatybilności HDLoader'a aby zobaczyć które gry mają z tą łatką problemy. (Zwykle oznaczone jako wymagające 'trybu 1' lub 'wolnego DVD')
ru_ru: Для получения списка игр, которые испытывают проблемы при использовании данного хака, вы можете обратитьcя к списку совмесимости HDLoader'а (смотрите по "mode1" и "slow DVD").
sv_se: Undersök HDLoader's förenlighetslista för spel som till vetskap kommer till fråga med det här (ofta markerat som behövande ''läge 1'' eller ''långsam DVD'').
th_th: ตรวจสอบรายการเข้ากันได้ของ HDLoader สำหรับเกมที่ทราบและมีการออกสิ่งนี้ไว้ (มักจะทำหมายเหตุว่า ความต้องการ 'mode 1' หรือ 'slow DVD')
zh_tw: 查閱 HDLoader 相容性列表，以確定已知使用這個選項會出現問題的遊戲。 通常是有注明需要 mode 1（模式 1）或 slow DVD（慢速 DVD）的遊戲。

source: Note that when Framelimiting is disabled, Turbo and SlowMotion modes will not be available either.
es_es: Observa que al desactivar la limitación de fotogramas, los modos Turbo y Velocidad lenta no estarán disponibles.
it_it: Nota che quando il Limitatore Fotogrammi è disattivato anche le modalità Turbo e Rallentatore non sono più disponibili.
ja_jp: フレームレート制限が無効になっている場合、ターボ及びスローモーションモードは使用できません。
pl_pl: Miej na uwadze, że przy wyłączonym limicie klatek animacji, tryby Przyspieszony i Spowolniony nie będą dostępne.
ru_ru: Отключение лимита кадров отключит так же и Turbo-/Slowmotion-режимы.
sv_se: Bemärk att när Bildhastighetsbegränsning är spärrad så kommer lägena Turbo & Nedsatt heller inte att vara tillgängliga.
th_th: หมายเหตุ เมื่อการจำกัดเฟรมไม่ถูกใช้งาน โหมดเทอร์โบและโหมดเคลื่อนไหวช้า จะไม่มีผลทั้งคู่เช่นกัน
zh_tw: 注意：當畫框限制停用時，渦輪加速和慢動作無法使用。

source: Notice: Due to PS2 hardware design, precise frame skipping is impossible. Enabling it will cause severe graphical errors in some games.
es_es: Aviso: Debido al diseño del hardware de PS2, es imposible hacer un salto de fotogramas preciso. Activarlo causará serios fallos visuales en varios juegos.
it_it: Avviso: a causa del design hardware della PS2, un salto dei fotogrammi preciso non è possibile. La sua attivazione può causare gravi errori grafici in alcuni giochi.
ja_jp: メモ：PS2のハードウェアの仕様により、 正確なフレームスキップは不可能です。 有効にすると、ゲームによってはグラフィックに 深刻なエラーを発生させる事があります。
pl_pl: Uwaga: Ze względu na architekturę PS2, precyzyjne pomijanie klatek animacji, jest niemożliwe. Włączenie tej opcji z całą pewnością będzie powodowało masę błędów graficznych w wielu grach.
ru_ru: Примечание: ввиду особенностей архитектуры аппаратной части PS2, аккуратный пропуск кадров невозможен в принципе. Поэтому, его активация может спровоцировать появление графических артефактов в некоторых играх.
sv_se: Bemärk: Till följd av PS2's hårdvaruutformning så är precist bildöverhoppande ouppnåeligt. Att tillämpa det kan orsaka rejäla grafikfel för vissa spel.
th_th: แจ้ง: เนื่องด้วยการออกแบบเครื่อง PS2, การข้ามเฟรมแบบแม่นยำจึงเป็นไปไม่ได้ การใช้มันจะเกิดความผิดพลาดที่รุนแรงของกราฟิกในบางเกม
zh_tw: 注意： 由於 PS2 的硬體設計，精確的跳框是不可能的。 啟用跳框將導致一些遊戲出現嚴重的圖形錯誤。

source: Enable this if you think MTGS thread sync is causing crashes or graphical errors.
es_es: Activa esta opción si crees que la sincronía de hilos MTGS provoca caídas o fallos gráficos.
it_it: Attiva questa opzione se pensi che la perdita di sincronia del thread MTGS sia la causa di crash o problemi grafici.
ja_jp: クラッシュやグラフィックエラーの発生原因として、 MTGSスレッドの同期が疑わしい場合は有効にして下さい。
pl_pl: Użyj tej opcji jeśli podejrzewasz, że synchronizacja wątku MTGS odpowiada za zawieszanie się lub graficzne błędy w jakiejś grze.
ru_ru: Включайте данную опцию только в том случае, если вы думаете что синхронизация потоков MTGS приводит к вылетам или графическим артефактам.
sv_se: Tillämpa detta ifall Ni tror att MTGS-trådsync orsakar braker eller grafiska fel.
th_th: ลบตัวรบกวน benchmark ใด ๆ ที่เกิดจากสายงาน MTGS หรือเหนือหัว GPU ตัวเลือกนี้จะดีที่สุดถ้าใช้ร่วมกับ การบันทึกสถานภาพ: บันทึกสถานภาพที่สภาวะในอุดมคติ, ใช้งานตัวเลือกนี้ และโหลดบันทึกสถานภาพอีกครั้ง คำเตือน: ตัวเลือกนี้สามารถเลือกใช้ตอนไหนก็ได้ แต่จะไม่สามารถเลิกการใช้ตอนไหนก็ได้ (วิดีโอจะมีลักษณะแย่)
zh_tw: 啟用這個選項，若您認為多執行緒圖形模式執行緒的同步正在導致模擬器當掉或圖形錯誤。

source: Removes any benchmark noise caused by the MTGS thread or GPU overhead. This option is best used in conjunction with savestates: save a state at an ideal scene, enable this option, and re-load the savestate. Warning: This option can be enabled on-the-fly but typically cannot be disabled on-the-fly (video will typically be garbage).
es_es: Elimina cualquier ruido de benchmark provocado por el hilo MTGS o la elevación de la GPU. Esta opción se utiliza junto con los guardados rápidos: guarda un guardado rápido en la escena ideal, activa esta opción, y luego vuelve a cargar el guardado rápido. Aviso: Esta opción puede activarse al vuelo, pero normalmente no puede desactivarse al vuelo (la imagen se mostrará dañada).
it_it: Nei benchmark, permette di rimuovere ogni interferenza causata dal thread MTGS o dall'overhead della GPU. Questa opzione è sfruttata al meglio in congiunzione ai salvataggi di stato: salva uno stato prima della scena ideale, quindi abilita questa opzione e ricarica il salvataggio di stato. Attenzione: Questa opzione può essere attivata durante l'esecuzione, ma non disattivata (la schermata visualizzata sarà in pratica spazzatura poligonale).
ja_jp: MTGSスレッド又はGPUオーバーヘッドにより発生されるベンチマークノイズを除去します。このオプションはセーブステートと併用して利用する事が適切です。 都合のつく所でセーブステートを行い、オプションを有効にした後に、セーブステートをロードしてください。 警告： このオプションはゲーム実行中に有効化できますが、無効化する事はできません（映像出力内容の判別ができなくなります）。
pl_pl: Usuwa wszelkie nieprawidłowości spowodowane przez wątek MTGS lub GPU. Najlepiej używać tej opcji w połączeniu z zapisami stanu gier. - Zapisać w idealnej scenie, zaznaczyć tę opcję i wgrać zapis. Uwaga: Ta opcja może być włączona w każdym momencie, lecz nagle wyłączona, będzie powodować błędy graficzne.
ru_ru: Отключает обработку всех GS-данных, тем самым убирая возможный замедляющий фактор при замерах производительность остальных компонентов эмулятора. Идеально для использования в комбинации с быстрыми сохранениями: выберите нужную сцену в игре, сохранитесь, включите данную опцию и загрузите быстрое сохранение. Примечание: данная опция применяется "на лету", однако ее последующее отключение в реальном времени чревато появлением графического мусора в игре.
sv_se: Tar bort allt norm-oljud orsakat av MTGS-trådens eler GPU'ns överdrag. Denna funktion används bäst i förening med Sparpunkter: gör en Sparpunkt i en idealisk scen, tillämpa denna funktion, och återladda därefter Sparpunkten. Varning: Denna funktion kan möjliggöras dynamiskt men kan vanligtvis inte spärras på samma vis (video blir ofta skräp).
th_th: ลบตัวรบกวน benchmark ใด ๆ ที่เกิดจากสายงาน MTGS หรือเหนือหัว GPU ตัวเลือกนี้จะดีที่สุดถ้าใช้ร่วมกับ การบันทึกสถานภาพ: บันทึกสถานภาพที่สภาวะในอุดมคติ, ใช้งานสิ่งนี้ และโหลดบันทึกสถานภาพอีกครั้ง คำเตือน: ตัวเลือกนี้สามารถถูกใช้ตอนไหนก็ได้ แต่ไม่สามารถยกเลิกตอนไหนก็ได้ (วิดีโอมักจะมีลักษณะแย่) "
zh_tw: 移除任何由多執行緒圖形模式的執行緒過載或 GPU 過載引起的效能測試產生的噪音。 這個選項最好是和即時存檔配合使用： 在一個理想的畫面儲存即時存檔，啟用這個選項，再讀取即時存檔。 警告：這個選項在遊戲運行時啟用即可生效，但無法在遊戲運行時停用（圖像變得垃圾）。

source: Your system is too low on virtual resources for PCSX2 to run. This can be caused by having a small or disabled swapfile, or by other programs that are hogging resources.
es_es: Tu sistema tiene muy pocos recursos virtuales para que PCSX2 pueda funcionar. Esto lo puede provocar tener un swapfile pequeño o desactivado, o que otros programas estén acaparando recursos.
it_it: Il tuo sistema ha troppe poche risorse virtuali per eseguire PCSX2. Questo può essere causato da un file di scambio piccolo o disattivato, o da altri programmi che stanno occupando le risorse.
ja_jp: PCSX2を実行する為の仮想メモリリソースが不足しています。スワップファイルが小さすぎるか 無効にされている場合や、他のプログラムがメモリの多くを消費している時に発生します。
pl_pl: Twój system nie posiada wystarczających zasobów wirtualnych by uruchomić PCSX2. Najpewniej jest to spowodowane wyłączonym plikiem wymiany windowsa, lub zbyt małą jego wielkością. Możliwe też, że w tej chwili masz uruchomione inne pamięciożerne programy.
ru_ru: Недостаточно виртуальной памяти для запуска PCSX2. Возможно, у вас отключен своп-файл или какая-то другая программа "съела" все системные ресурсы.
sv_se: Ert system har för lite virtuella resurser för att PCSX2 ska kunna köras. Detta kan ha orsakats genom att ha en liten eller spärrad växlingsfil, eller av att andra program tar för sig av tillgångarna.
th_th: ระบบของคุณช้าเกินไปที่จะเป็นแหล่งทรัพยากรจำลองสำหรับ PCSX2 ในการรัน นี่อาจเกิดจาก swapfile เล็กหรือไม่ถูกใช้งาน หรือเพราะโปรแกรมอื่นที่กินทรัพยากร
zh_tw: 您的系統虛擬資源過低，以致 PCSX2 無法運行。 可能由分頁檔案小或沒有分頁檔案引起， 或由其他獨占資源的程式引起。

source: Out of Memory (sorta): The SuperVU recompiler was unable to reserve the specific memory ranges required, and will not be available for use. This is not a critical error, since the sVU rec is obsolete, and you should use microVU instead anyway. :)
es_es: Sin memoria (algo parecido): El recompilador SuperVU no ha podido reservar los rangos de memoria concretos que son necesarios, y no podrá ser utilizado. Este no es un error crítico, ya que el recompilador SuperVU es obsoleto, y deberías utilizar en su lugar microVU. :)
it_it: Memoria Esaurita (più o meno): il ricompilatore superVU non è riuscito a riservare il range di memoria specifico richiesto, non sarà quindi disponibile all'utilizzo. Questo non è un errore critico, dato che il ricompilatore superVU è obsoleto e in ogni caso dovresti utilizzare microVU. :)
ja_jp: メモリ不足（多少）：重大なエラーではありません。SuperVUリコンパイラーが 必要とする特定のメモリ領域を確保する事ができなかったので使用不可となりました。 sVU rec は旧式なので、変わりに microVU を使用した方が良いでしょう。 (^-^)
pl_pl: Zabrakło Pamięci(Tak jakby): Rekompilator SuperVU nie mógł zarezerwować odpowiedniej ilości pamięci i nie będzie działać. To nie jest błąd krytyczny, gdyż sVU jest zbędny i tak czy siak powinieneś użyć rekompilatora microVU.:3
ru_ru: Out of Memory (типа): рекомпилятор SuperVU не смог зарезервировать необходимое адресное пространство и не может быть использован. Впрочем, не стоит расстраиваться, ведь SuperVU устарел и вы всегда можете выбрать "новый и блестящий" microVU :P
sv_se: Slut på Minne (typ): superVU omkompileraren var oförmögen att reservera den mängd särskilda minne som krävs, och kommer inte vara tillgänglig för bruk. Detta är inte ett kritiskt fel eftersom sVU är föråldrat, och följdaktligen borde Ni hur som helst använda Er av microVU istället.
th_th: หน่วยความจำหมด (sorta), รีคอมไพเลอร์ SuperVU ไม่สามารถสงวนช่วงหน่วยความจำจำเพาะที่ต้องการ และไม่เหลือให้ใช้การได้ นี่ไม่ใช่ความผิดพลาดที่วิกฤต นับตั้งแต่ sVU rec นั้นล้าสมัยแล้ว ถึงกระนั้นคุณควรใช้ microVU แทน :)
zh_tw: 幾乎是 Out of Memory： SuperVU 無法留住所需要的指定的記憶體範圍，SuperVU 不可用。 這不是嚴重的錯誤，因為 SuperVU 是過時的。無論如何，您應該使用 microVU 代替。：）
