Repository: RPCS3/rpcs3
Catalog: locales/*/pcsx2_Devel.po
Languages: tr_tr

source: Dumps detailed information for PS2 executables (ELFs).
tr_tr: PS2 ELF dosyalarını ayrıntılı olarak günlükle.

source: Logs manual protection, split blocks, and other things that might impact performance.
tr_tr: Manual koruma, blok ayırma ve diğer performansı etkileyecek zamazingoları günlükler.

source: Shows the game developer's logging text (EE processor)
tr_tr: Oyun üreticisinin günlükleme dosyasını gösterir (EE işlemcisi)

source: Shows the game developer's logging text (IOP processor)
tr_tr: Oyun üreticisinin günlükleme dosyasını gösterir (IOP işlemcisi)

source: Shows DECI2 debugging logs (EE processor)
tr_tr: DECI2 test günlükleri (EE işlemcisi)

source: SYSCALL and DECI2 activity.
tr_tr: SYSCALL ve DECI2 etkinliği.

source: Direct memory accesses to unknown or unmapped EE memory space.
tr_tr: Bilinmeyen ya da belirtilmemiş EE hafıza konumuna doğrudan erişim.

source: Disasm of executing core instructions (excluding COPs and CACHE).
tr_tr: Yürütme yönergelerinin ayrımı (COPs ve CACHE hariç)

source: Disasm of COP0 instructions (MMU, cpu and dma status, etc).
tr_tr: COP0 yönergelerinin ayrımı (MMU, işlemci ve dma durumları vb).

source: Disasm of the EE's floating point unit (FPU) only.
tr_tr: EE'nin FPU ayrımı.

source: Disasm of the EE's VU0macro co-processor instructions.
tr_tr: EE'nin VU0macro işlemci yönergelerinin ayrımı.

source: Execution of EE cache instructions.
tr_tr: EE önbellek yönergelerinin yürütülmesi.

source: All known hardware register accesses (very slow!); not including sub filter options below.
tr_tr: Altta belirtilen filtreler hariç tüm bilinen donanım erişimleri (ÇOK YAVAŞ!).

source: Logs only unknown, unmapped, or unimplemented register accesses.
tr_tr: Yalnızca bilinmeyen, ayarlanmamış ve düzenlenmemiş erişim girdilerini günlükler.

source: Logs only DMA-related registers.
tr_tr: Yalnızca DMA ile ilgili girişleri günlükler.

source: IPU activity: hardware registers, decoding operations, DMA status, etc.
tr_tr: IPU etkinliği: donanım erişimleri, çözümleme işlemleri, DMA durumu vb...

source: All GIFtag parse activity; path index, tag type, etc.
tr_tr: Tüm GIFtag etkinliği; klasör indeksleme, etiket türü vb...

source: All VIFcode processing; command, tag style, interrupts.
tr_tr: Tüm VIFcode işlemleri; komutlar, tag türü, hatalar.

source: Scratchpad's MFIFO activity.
tr_tr: Scratchpad'in MFIFO etkinliği.

source: Actual data transfer logs, bus right arbitration, stalls, etc.
tr_tr: Dosya transfer günlükleri, beklemeler vb.

source: Tracks all EE counters events and some counter register activity.
tr_tr: Tüm EE sayaç olaylarını ve bazı girdi etkinliklerini izler.

source: Dumps various VIF and VIFcode processing data.
tr_tr: Çeşitli VIF ve VIFcode işlemlerini yığınlar.

source: Dumps various GIF and GIFtag parsing data.
tr_tr: Çeşitlli GIF ve GIFtag verilerini yığınlar.

source: SYSCALL and IRX activity.
tr_tr: SYSCALL ve IRX etkinliği.

source: Direct memory accesses to unknown or unmapped IOP memory space.
tr_tr: Bilinmeyen ya da belirtilmemiş IOP hafıza konumuna doğrudan erişim.

source: Disasm of the IOP's GPU co-processor instructions.
tr_tr: IOS'nin GPU işlemcili yönergelerininin ayrımı.

source: All known hardware register accesses, not including the sub-filters below.
tr_tr: Alttaki filtreleri içermeyen tüm bilinen donanım erişimleri.

source: Memorycard reads, writes, erases, terminators, and other processing.
tr_tr: Hafıza kartı okumaları, yazmaları, silmeleri ve diğer işlemler.

source: Gamepad activity on the SIO.
tr_tr: SIO'daki oyun kolu etkinliği.

source: Actual DMA event processing and data transfer logs.
tr_tr: DMA olay işlemi ve dosya transfer günlükleri.

source: Tracks all IOP counters events and some counter register activity.
tr_tr: Tüm IOP sayaç olaylarını ve diğer sayaç girdisi etkinliklerini izler.

source: Detailed logging of CDVD hardware.
tr_tr: CDVD donanımının detaylı günlüklemesi.
