Repository: RPCS3/rpcs3
Catalog: locales/*/pcsx2_Iconized.po
Languages: es_es, it_it, ja_jp, pl_pl, ru_ru, sv_se, th_th, zh_tw

source: There is not enough virtual memory available, or necessary virtual memory mappings have already been reserved by other processes, services, or DLLs.
es_es: No hay la suficiente memoria virtual disponible, o las asignaciones de memoria virtual necesarias ya las han reservado otros procesos, servicios o DLLs.
it_it: Non c'è abbastanza memoria virtuale disponibile o gli spazi della memoria virtuale necessari sono già stati riservati ad altri processi, servizi o DLL.
ja_jp: 仮想メモリが不足しているか、必要な仮想メモリは既に他のプロセス、サービス、DLLに割り当てられています。
pl_pl: Brak wystarczającej pamięci wirtualnej lub potrzebna pamięć wirtualna została już zarezerwowana przez inny process, usługę lub DLL.
ru_ru: В вашей системе недостаточно виртуальной памяти, либо же, доступное адресное пространство уже занято другим процессом, службой или библиотеками.
sv_se: Det finns inte tillräckligt med Virtuellt Minne tillgängligt, eller så har den nödvändiga tilldelningen av Virtuellt Minne redan blivit reserverat av andra processer, tjänster eller DLL'er.
th_th: มีหน่วยความจำเสมือนที่ไม่เพียงพอ หรือการแม็พหน่วยความจำเสมือน ที่จำเป็นได้ถูกเก็บไว้โดยกระบวน, บริการ หรือ DLL อื่นๆ
zh_tw: 可用的虛擬記憶體不足， 或必備的虛擬記憶體映射已經被其他處理程序、服務，或 DLL 保留。

source: Playstation game discs are not supported by PCSX2. If you want to emulate PSX games then you'll have to download a PSX-specific emulator, such as ePSXe or PCSX.
es_es: PCSX2 no admite discos de juego de PlayStation 1. Si quieres emular juegos de PSX tendrás que descargarte un emulador específico para PSX, como ePSXe o PCSX.
it_it: I dischi di gioco per PlayStation non sono supportati in PCSX2. Se desideri emulare i giochi della PSX dovrai scaricare un emulatore specifico per PSX, come ePSXe o PCSX.
ja_jp: プレイステーション1のディスクはPCSX2でサポートされていません。 ePSXeやPCSXなどのPS1向けのエミュレーターをお使い下さい。
pl_pl: Gry z Playstation nie są obsługiwane przez PCSX2. Jeśli chcesz emulować gry PSX musisz ściągnąć emulator PSX taki jak ePSXe lub PCSX.
ru_ru: Эмулятор PCSX2 не поддерживает игры от PlayStation. Если вы желаете запустить игры от PSX, используйте соответствующий эмулятор: ePSXe или PCSX.
sv_se: PlayStation®One speldiskar stödjes icke av PCSX2. Om Ni vill emulera PSX-spel får Ni använda en särskild PSX-emulator, såsom ePSXe eller PCSX.
th_th: PCSX2 ไม่รองรับดิสก์เกม Playstation 1
zh_tw: PCSX2 不支援 Playstation 遊戲光碟。 若您想要模擬 PS 遊戲，您必須下載 PS 模擬器，譬如 ePSXe 或 PCSX。

source: This recompiler was unable to reserve contiguous memory required for internal caches. This error can be caused by low virtual memory resources, such as a small or disabled swapfile, or by another program that is hogging a lot of memory.
es_es: Este recompilador no ha podido reservar la memoria contigua necesaria para las cachés internas. Este error lo puede provocar una cantidad baja de recursos de memoria virtual, como un swapfile pequeño o desactivado, o cualquier otro programa que esté acumulando mucha memoria.
ja_jp: リコンパイラーが内部キャッシュ用の連続したメモリを確保する事ができませんでした。このエラーは仮想メモリの リソースが不足していると発生します。仮想メモリが小さすぎるか、無効にされている場合や、他のプログラムが 多くのメモリを消費している時に発生します。ホスト設定でPCSX2のリコンパイラのデフォルトキャッシュサイズを 小さく設定する事で問題を解決できる事があります。
sv_se: Denna omkompilerare var oförmögen att reservera det kringliggande minne som krävs för dess egna förråd, ett fel som kan ha orsakats av en låg tillgång av Virtuellt Minne, exempelvis genom en liten eller spärrad växlingsfil, eller av att ett annat program tar för sig mycket minne.

source: PCSX2 is unable to allocate memory needed for the PS2 virtual machine. Close out some memory hogging background tasks and try again.
es_es: PCSX no puede ubicar la memoria necesaria para la máquina virtual de PS2. Cierra cualquier programa en segundo plano que esté acumulando recursos y vuelve a intentarlo.
it_it: PCSX2 non è in grado di allocare la memoria necessaria per la macchina virtuale PS2. Chiudi dei task in background che stanno occupando memoria e prova di nuovo.
ja_jp: PCSX2はPS2仮想マシンに必要なメモリを割り当てる事ができませんでした。 バックグラウンドタスクを終了させ、メモリを解放してから再試行して下さい。
pl_pl: PCSX2 nie był w stanie zarezerwować odpowiedniej ilości pamięci potrzebnej virtualnej maszynie PS2. Zamknij niepotrzebne programy i usługi działające w tle i spróbuj ponownie.
ru_ru: Эмулятор PCSX2 не смог зарезервировать объем памяти, необходимый для виртуальной машины PS2. Попробуйте закрыть какие-либо "тяжелые" приложения (антивирус, браузер) и перезапустите PCSX2.
sv_se: PCSX2 är oförmögen att tilldela det minne som krävs för PS2's Virtuella Maskin. Stäng minneskrävande bakgrundsprogram och försök igen.
th_th: PCSX2 ไม่สามารถแบ่งหน่วยความจำที่ต้องการสำหรับเครื่องเสมือน PS2 ลองปิดงานเบื้องหลังบางงานที่กินหน่วยความจำ แล้วลองอีกครั้ง
zh_tw: PCSX2 無法分配 PS2 虛擬機需要的記憶體。 關閉一些獨占記憶體的背景工作並再次嘗試。

source: Warning: Your computer does not support SSE2, which is required by many PCSX2 recompilers and plugins. Your options will be limited and emulation will be *very* slow.
es_es: Aviso: Tu ordenador no admite SSE2, que es necesario por la mayoría de recompiladores y plugins de PCSX2. Tus opciones estarán limitadas y la emulación será *muy* lenta.
it_it: Attenzione: il tuo computer non supporta le SSE2, che sono richieste da molti plugin e ricompilatori di PCSX2. Le tue opzioni saranno limitate e l'emulazione sarà *molto* lenta.
ja_jp: 警告：お使いのCPUは、PCSX2のリコンパイラーやプラグインが必要とするSSE2に対応していません。 選択できるオプションが限られ、エミュレーション速度は*非常に*遅くなります。
pl_pl: Uwaga: Twój komputer nie wspomaga SSE2, który jest wymagany przez wiele rekompilatorów i wtyczek PCSX2. Twoje opcje będą ograniczone a emulacja będzie BARDZO powolna.
ru_ru: Внимание: ваш компьютер не поддерживает SSE2-инструкции, необходимые для работы многих плагинов и опций PCSX2. Вы будете ограничены в настройках эмулятора, а сам процесс эмуляции будет *очень* медленным.
sv_se: Varning: Er dator stödjer inte SSE2, vilket krävs för många av PCSX2's omkompilerare och InsticksProgram. Era möjligheter kommer vara begränsade och emuleringen blir *mycket* långsam.
th_th: คำเตือน: คอมพิวเตอร์ของคุณไม่รองรับ SSE2 ซึ่งจำเป็นสำหรับรีคอมไพเลอร์และปลั๊กอินหลายตัวของ PCSX2 ตัวเลือกของคุณจะมีอย่างจำกัด และการจำลองจะให้ผลที่ช้า*มาก*
zh_tw: 警告：您的電腦不支援 SSE2，許多 PCSX2 的反編譯裝置和插件需要 SSE2。 您可供調整的模擬器選項將會受到限制，並且遊戲速度會「非常」慢。

source: Warning: Some of the configured PS2 recompilers failed to initialize and have been disabled:
es_es: Aviso: Algunos de los recompiladores configurados de PS2 no se han iniciado y por lo tanto están desactivados:
it_it: Attenzione: alcuni dei ricompilatori PS2 configurati hanno fallito l'inizializzazione e sono stati disabilitati:
ja_jp: 警告：設定されたいくつかのPS2リコンパイラーが初期化に失敗し、無効にされました。
pl_pl: Uwaga: Niektóre ze skonfigurowanych rekompilatorów zawiodły i zostały wyłączone.
ru_ru: Внимание: произошла ошибка инициализации некоторых рекомпиляторов PCSX2, они будут автоматически отключены.
sv_se: Varning: Några av de konfigurerade PS2-omkompilerarna misslyckades att köras igång och har blivit spärrade:
th_th: คำเตือน: รีคอมไพเลอร์บางตัวของ PS2 ที่กำหนดค่าไว้ ล้มเหลวในการเริ่มต้นและไม่ถูกใช้งาน
zh_tw: 警告：某些指定的 PS2 反編譯裝置初始化失敗，並且被停用：

source: Note: Recompilers are not necessary for PCSX2 to run, however they typically improve emulation speed substantially. You may have to manually re-enable the recompilers listed above, if you resolve the errors.
es_es: Nota: Los recompiladores no son necesarios para el funcionamiento de PCSX2, sin embargo suelen mejorar la velocidad de emulación sustancialmente. Tendrás que volver a activar manualmente los recompiladores indicados encima, si consigues arreglar los errores.
it_it: Nota: i ricompilatori non sono necessari per l'esecuzione di PCSX2, ma permettono un netto miglioramento della velocità di emulazione. Se puoi risolvere gli errori, sarà necessario riabilitare i ricompilatori elencati qui sopra manualmente.
ja_jp: メモ：PCSX2の実行にリコンパイラーは必須ではありませんが、エミュレーション速度が大幅に向上します。 エラーを解決した後に、上記リストのリコンパイラーを手動で有効化しなおす必要があるかもしれません。
pl_pl: Uwaga: Rekompilatory nie są potrzebne do uruchomienia PCSX2, jednak bardzo poprawiają prędkość emulacji. Będziesz musiał ręcznie przywrócić wymienione rekompilatory jeśli rozwiążesz problemy.
ru_ru: Примечание: наличие рекомпиляторов не критично для работы PCSX2 в целом, однако, они позволяют ускорить процесс эмуляции в разы. Вы можете включить их снова в настройках эмуляции PCSX2 сразу после того, как устраните причину ошибки.
sv_se: Bemärk: Omkompilerare är inte nödvändiga för att PCSX2 ska kunna köras, men de förbättrar oftast emuleringshastigheten avsevärt. Ni kanske måste återmöjliggöra omkompilerarna ovanför egenhändigt, om Ni löser fel.
th_th: หมายเหตุ: รีคอมไพเลอร์ไม่จำเป็นสำหรับการรัน PCSX2 อย่างไรก็ตาม มันจะช่วยปรับปรุงความเร็วของการจำลองอย่างเห็นได้ คุณอาจจะลองใช้งานรีคอมไพเลอร์ที่ระบุไว้ด้านบนอีกครั้ง หากคุณต้องการจะแก้ปัญหา
zh_tw: 注意：反編譯裝置並非執行 PCSX2 所必須的，但反編譯裝置大幅提升遊戲速度。 若錯誤已經解決，您可能必須手動重新啟用上面列出的反編譯裝置。

source: PCSX2 requires a PS2 BIOS in order to run. For legal reasons, you *must* obtain a BIOS from an actual PS2 unit that you own (borrowing doesn't count). Please consult the FAQs and Guides for further instructions.
es_es: PCSX2 necesita una BIOS de PS2 para poder funcionar. Por motivos legales, *debes* conseguir una BIOS de una consola PS2 real que poseas (no vale pedirla prestada). Consulta los FAQs y las guías para tener más información.
it_it: PCSX2 richiede il BIOS della PS2 per funzionare. Per questioni legali, *è necessario* che tu ottenga il BIOS da una vera PS2 di *tua proprietà* (il prestito non conta). Per favore consulta le FAQ e le guide per ulteriori istruzioni.
ja_jp: PCSX2を実行するにはPS2のBIOSが必要です。あなた自身が所有する（借り物はダメです）PS2の実機から 「合法的に」手に入れて下さい。詳しい吸出し方法はFAQやガイドを参照して下さい。
pl_pl: PCSX2 wymaga BIOS'u PS2 do działania. Ze względów prawnych MUSISZ sam uzyskać BIOS, wydobywając go z własnej konsoli PS2(pożyczanie się nie liczy!). Po szczegóły proszę zapoznaj się z FAQ oraz poradnikami.
ru_ru: Для работы эмулятора PCSX2 вам нужна *легальная* копия образа BIOS'а из вашей PS2. Вы не можете использовать образ, скачанный из интернета или полученный от друзей. Используйте спец-программы для сохранения вашей собственной копии BIOS'а с вашей консоли.
sv_se: PCSX2 kräver PS2-BIOS för att köras. Av juridiska skäl *måste* Ni anskaffa ett BIOS från en faktisk PS2-enhet som Ni äger (tillåns gäller inte). Undersök FAQ'er och Guider för ytterligare information.
th_th: PCSX2 ต้องการไบออส (BIOS) ของ PS2 เพื่อที่จะรัน เพื่อเหตุผลที่ถูกกฎหมาย คุณ*ต้อง* เอาไบออสมาจากตัว PS2 ที่แท้จริงของคุณเอง (ไม่นับการยืม) โปรดศึกษาจากแนวทางและคำถามที่พบบ่อยสำหรับคำแนะนำเพิ่มเติม
zh_tw: PCSX2 需要 PS2 BIOS 才能運行遊戲。 出於法律上的原因， 您「必須」從您自己的 PS2 真實遊戲主機獲取 BIOS （借的 PS2 不算）。 進一步的說明請洽 FAQ 和指南。

source: 'Ignore' to continue waiting for the thread to respond. 'Cancel' to attempt to cancel the thread. 'Terminate' to quit PCSX2 immediately.
es_es: 'Ignorar' para seguir esperando a que el hilo responda. 'Cancelar' para intentar cancelar el hilo. 'Terminar' para abandonar PCSX2 de inmediato.
it_it: 'Ignora' consente di continuare ad attendere la risposta del thread. 'Annulla' per tentare di annullare il thread. 'Termina' per chiudere PCSX2 immediatamente.
ja_jp: [無視] スレッドの応答を待ちます。 [キャンセル] スレッドのキャンセルを試行します。 [終了] PCSX2をただちに終了させます。
pl_pl: 'Ignoruj' by contynuować aż wątek zacznie odpowiadać. 'Anuluj' by spróbować anulować wątek. 'Likwiduj' by wezwać Leona Zawodowca i zbawić swój komputer od PCSX2.
ru_ru: Выберите 'Игнорировать' если хотите подождать ответа.Выберите 'Отмена' если желаете закрыть поток.Выберите 'Выход' если хотите завершить работу PCSX2.
sv_se: ''Förbise'' för att fortsätta vänta på trådarna att svara. ''Avbryt'' för att försöka avbryta tråden. ''Avsluta'' för att omedelebart stänga PCSX2.
th_th: 'ละเลย' เพื่อรอให้สายงานตอบสนองต่อไป 'ยกเลิก' เพื่อพยายามยกเลิกสายงาน 'สิ้นสุด' เพื่อออกจาก PCSX2 โดยทันที
zh_tw: 【忽略】繼續等待執行緒回應。 【取消】嘗試取消執行緒。 【終止】立即退出 PCSX2。

source: Please ensure that these folders are created and that your user account is granted write permissions to them -- or re-run PCSX2 with elevated (administrator) rights, which should grant PCSX2 the ability to create the necessary folders itself. If you do not have elevated rights on this computer, then you will need to switch to User Documents mode (click button below).
es_es: Asegúrate de que estas carpetas son creadas y de que tu cuenta de usuario tiene los permisos para escribir en ellas; o vuelve a ejecutar PCSX2 con derechos superiores (de administrador), que debería dar a PCSX2 la capacidad de crear las carpetas necesarias por su cuenta. Si no tienes los permisos superiores en este ordenador, tendrás que cambiar al modo de Documentos del usuario (pulsa en el botón de abajo).
it_it: Per favore assicurati che queste cartelle esistano e che il tuo account utente abbia i permessi per la loro modifica -- oppure prova a riavviare PCSX2 con privilegi più elevati (amministratore), questo dovrebbe garantire a PCSX2 la facoltà di creare in modo autonomo le proprie cartelle. Se non possiedi privilegi elevati in questo computer, dovrai utilizzare la Modalità Documenti Utente (fai clic sul pulsante qui sotto).
ja_jp: これらのフォルダーが作成され、使用中のユーザーアカウントに書き込み権限がある事を確認して下さい。 また、PCSX2を管理者権限で再度起動すると、PCSX2が必要なフォルダーを自動的に作成されます。 管理者権限がない場合、ユーザードキュメントモードに切り替える必要があります （下のボタンをクリック）
pl_pl: Proszę upewnić się, że te katalogi są stworzone a Twoje konto ma pozwolenie zapisu w nich, lub uruchom PCSX2 ponownie jako administrator, co pozwoli PCSX2 stworzyć te pliki za Ciebie. Jeśli nie posiadasz praw administratora na tym komputerze, będziesz musiał przełączyć opcje na Tryb użytkownika - Moje Dokumenty(kliknij przycisk poniżej).
ru_ru: Пожалуста убедитесь что эти папки были созданы и ваш пользовательский аккаунт предоставил им разрешение на запись -- или перезапустите PCSX2 с повышанными (Административными) правами, которые предоставят PCSX2 возможность создавать необходимые папки самому. Если у вас нет повышенных прав на этом компьютере то вам придеться переключиться на пользовательский "мод" (кликните на кнопочку рядом).
sv_se: Försäkra Er om att dessa Mappar är skapade och att Er AnvändarBehörighet medger skrivning för dem -- eller återkör PCSX2 med upphöjd (Administratörs) Behörighet, vilket borde bevilja PCSX2 att skapa de nödvändiga Mapparna självt. Om Ni inte har upphöjd Behörighet för Er dator, får Ni byta till AnvändarnivåDokument-läge (klicka på knappen nedanför).
th_th: โปรดแน่ใจว่าโฟลเดอร์นี้ได้ถูกสร้าง และบัญชีผู้ใช้ของคุณได้รับอนุญาต อาจทำการอนุญาต (permission) ให้พวกมัน -- หรือ รัน PCSX2 ด้วยสิทธิที่สูงขึ้น(ผู้ดูแลระบบ) ซึ่งจะอนุญาตให้ PCSX2 สามารถทำการสร้างโฟลเดอร์ที่จำเป็นเองได้ ถ้าคุณไม่มีสิทธิที่สูงกว่าในคอมพิวเตอร์นี้ นั่นคุณจำเป็นต้องสลับ ไปใช้โหมดเอกสารผู้ใช้ (คลิกปุ่มด้านล่าง)
zh_tw: 請確保這些資料夾已經建立，並且您的帳戶具有寫入這些資料夾的權限； 或以更高的（管理員）權限重新執行 PCSX2 應該就能夠建立必需的資料夾。 若您在這台電腦上沒有更高的權限，則需要切換至【我的文件】模式（按下方的按鈕）。

source: NTFS compression can be changed manually at any time by using file properties from Windows Explorer.
es_es: La compresión NTFS puede cambiarse a mano en cualquier momento utilizando las propiedades del archivo en el Explorador de Windows.
it_it: La compressione NTFS può essere modificata in ogni momento utilizzando la finestra proprietà file in Windows Explorer.
ja_jp: NTFS圧縮はエクスプローラーのファイルプロパティから手動でいつでも設定変更できます。
pl_pl: Kompresja NTFS może być ręcznie zmieniona w każdej chwili używając właściwości z Windows Exploera.
ru_ru: Режим NTFS-компрессии может быть изменен в любой момент времени через свойства файла Проводника Windows.
sv_se: NTFS-komprimering kan ändras egenhändigt när som helst genom Egenskaper hos Windows Utforskaren.
th_th: การบีบอัดแบบ NTFS คุณสามารถเปลี่ยนเองตอนไหนก็ได้โดยใช้คุณสมบัติไฟล์จากหน้าต่างสำรวจ
zh_tw: NTFS 壓縮能夠在任何時候手動變更，透過從檔案總管使用右鍵選單的「內容」選項。

source: This is the folder where PCSX2 saves your settings, including settings generated by most plugins (some older plugins may not respect this value).
es_es: Esta es la carpeta donde PCSX2 guarda tu configuración, incluyendo los ajustes generados por la mayoría de los plugins. (Los más antiguos pueden no seguir este parámetro)
it_it: In questa cartella PCSX2 salva le tue impostazioni, incluse le impostazioni create dalla maggior parte dei plugin (alcuni vecchi plugin potrebbero non attenersi a questa impostazione).
ja_jp: このフォルダーにはPCSX2とプラグインが生成した設定が保存されています。 （古いプラグインはこの値を使用しない事があります）
pl_pl: To jest katalog gdzie PCSX2 zachowuje Twoje ustawienia, wliczając w to ustawienia wygenerowane przez większość wtyczek(niektóre starsze wtyczki mogą z tego nie korzystać).
ru_ru: Папка, где PCSX2 будет хранить свои настройки, в том числе и настройки большинства плагинов (некоторые устаревшие плагины могут игнорировать данную опцию).
sv_se: Detta är Mappen där PCSX2 sparar Era Inställningar, samt Inställnngar skapade av de flesta InsticksProgram (dock kanske inte av vissa äldre).
th_th: นี่คือโฟลเดอร์ที่ PCSX2 บันทึกการตั้งค่าของคุณ รวมทั้งการตั้งค่า ที่ถูกสร้างขึ้นโดยปลั๊กอินส่วนใหญ่ (บางปลั๊กอินเก่าอาจไม่เป็นไปตามค่านี้)
zh_tw: PCSX2 用這個資料夾儲存您的設定，包括大多數插件的設定。 （一些較老的插件可能不將設定儲存在這個資料夾裡面）

source: You may optionally specify a location for your PCSX2 settings here. If the location contains existing PCSX2 settings, you will be given the option to import or overwrite them.
es_es: Puedes especificar de forma opcional la ubicación de la configuración de PCSX2 aquí. Si la ubicación ya contiene configuración de PCSX2, se te dará la opción de importarla o sobrescribirla.
it_it: Opzionalmente puoi specificare qui il percorso per le impostazioni di PCSX2. Se il percorso contiene delle impostazioni di PCSX2 preesistenti, ti sarà data la possibilità di importarle o sovrascriverle.
ja_jp: PCSX2の設定を保存するディレクトリーを任意に指定する事ができます。指定先のディレクトリに PCSX2設定が既にある場合はインポート又は上書きをするオプションが表示されます。
pl_pl: Możesz opcjonalnie wyszczególnić położenie swoich ustawień PCSX2 tutaj. Jeśli lokacja zawiera istniejące ustawienia PCSX2, będziesz mógł je importować bądź nadpisać.
ru_ru: Ниже вы можете указать отдельную папку для хранения настроек PCSX2. Если вы укажете папку с уже существующимим настройками PCSX2 вам будет предложен выбор импортировать их в текущую конфигурацию.
sv_se: Ni kan förslagsvis ange en placering för Era PCSX2-Inställningar här. Om placeringen innehåller befintliga PCSX2-Inställningar kommer Ni ges möjlighet att importera och överskriva.
th_th: คุณอาจจะระบุที่ตั้งของการตั้งค่า PCSX2 ของคุณได้ที่นี่ ถ้าที่ตั้งนั้นมีการตั้งค่า PCSX2 อยู่แล้ว คุณจะได้รับตัวเลือกในการนำเข้าหรือเขียนทับพวกมัน
zh_tw: 您可以在這裡指定一個位置用來儲存 PCSX2 的設定檔。 若指定的位置包含已經存在的 PCSX2 設定檔，您將會被問及匯入或覆寫現存的設定。

source: This wizard will help guide you through configuring plugins, memory cards, and BIOS. It is recommended if this is your first time installing %s that you view the readme and configuration guide.
es_es: Este asistente te guiará para configurar los plugins, tarjetas de memoria y BIOS. Si es la primera vez que instalas %s se recomienda que mires el archivo léeme y la guía de configuración.
it_it: Questa Procedura Guidata ti aiuterà nella configurazione dei plugin, delle memory card e del BIOS. Se si tratta della prima volta che installi %s è consigliata la consultazione della Guida alla Configurazione ed del file leggimi.
ja_jp: このウィザードではプラグイン、メモリーカード、BIOSの初期設定を行います。 %sを初めてインストールした方はReadmeと設定ガイドを始めにお読み下さい。
pl_pl: Ten Pomocnik Konfiguracji pomoże Ci skonfigurować wtyczki, karty pamięci oraz BIOS. Zalecamy zapoznanie się z plikiem readme oraz poradnikiem konfiguracji jeśli jest to Twoje pierwsze spotkanie z %s.
ru_ru: Этот волшебник поможет вам пройти через дебри настроек плагинов, карт памяти и БИОСа. Строго рекомендуеться если вы впервые производите установку %s то посмотрите FAQ и гайд по конфигурации.
sv_se: Denna Dialog kommer att hjälpleda Er genom konfigurering av InsticksProgram, Minneskort och BIOS. Ifall detta är första gången Ni installerar %s, Anrådes Ni att undersöka ''Läs mig'' och ''KonfigurationsVägledningen''.
zh_tw: 本精靈指導您配置插件、記憶卡、BIOS。 若您首次使用 %s，建議您閱讀《 讀我檔案 》和《 配置指南 》。

source: PCSX2 requires a *legal* copy of the PS2 BIOS in order to run games. You cannot use a copy obtained from a friend or the Internet. You must dump the BIOS from your *own* Playstation 2 console.
es_es: PCSX2 necesita una copia *legal* de una BIOS de PS2 para poder ejecutar juegos. No puedes utilizar una copia que te haya pasado un amigo o descargada de internet. Debes volcar la BIOS desde tu *propia* consola PlayStation 2.
it_it: PCSX2 richiede una copia *legale* del BIOS PS2 per eseguire i giochi. Non puoi utilizzare una copia ottenuta da un amico o da Internet. Devi creare un dump del BIOS dalla console PlayStation 2 di *tua* proprietà.
ja_jp: PCSX2を実行するには「合法的」に入手したPS2 BIOSが必要です。 友人やインターネットから入手したものは使用してはいけません。 「あなた自身が所有する」プレイステーション2本体からBIOSをダンプして下さい。
pl_pl: PCSX2 wymaga LEGALNEJ kopi BIOSu PS2 do uruchamiania gier. Nie możesz użyć kopi uzyskanej od znajomego lub z internetu. Musisz zrzucić swój własny BIOS ze swej własnej konsoli PS2.
ru_ru: Для работы эмулятора PCSX2 вам нужна *легальная* копия образа BIOS'а PS2. Вы не можете использовать образ, скачанный из интернета или полученный от друзей. Используйте спец-программы для сохранения вашей собственной копии BIOS'а с вашей консоли. Для более подробной информации обратитесь к руководству программы.
sv_se: PCSX2 kräver *lagligt* PS2-BIOS för att köra spel. Ni får inte använda en Kopia anförskaffat genom en vän eller Internet, utan måste dumpa BIOS'et från Er *egna* PlayStation®2 konsol.
th_th: PCSX2 ต้องการสำเนาที่*ถูกกฎหมาย*ของไบออส PS2 เพื่อที่จะรันเกมได้ คุณไม่สามารถใช้สำเนาจากเพื่อนหรืออินเตอร์เน็ต คุณต้องดัมพ์ไบออสจากคอนโซล Playstation 2 *ของคุณเอง*
zh_tw: 為了運行遊戲，PCSX2 要求一份「合法」的 PS2 BIOS 拷貝。 您不能使用一份從朋友或網路借來的 PS2 BIOS 拷貝。 您必須從您「自己」的 Playstation 2 遊戲主機擷取 BIOS。

source: Existing %s settings have been found in the configured settings folder. Would you like to import these settings or overwrite them with %s default values? (or press Cancel to select a different settings folder)
es_es: Se ha encontrado configuración ya existente de %s en la carpeta de configuración asignada. ¿Quieres importar esta configuración o sobrescribirla con los ajustes predeterminados de %s? (o pulsa en Cancelar para seleccionar otra carpeta de configuración)
it_it: Nella cartella configurata sono state trovate impostazioni di %s preesistenti. Desideri importare queste impostazioni o sovrascriverle con le impostazioni predefinite di %s? (o puoi premere Annulla per selezionare una diversa cartella per le impostazioni)
ja_jp: 設定フォルダに既存の%s設定が見つかりました。 この設定をインポート、又は%sのデフォルト値で上書きしますか？ （若しくはキャンセルを押して、別の設定フォルダーを選択して下さい）
pl_pl: Istniejące ustawienia %s zostały znalezione w skonfigurowanym katalogu ustawień. Czy chcesz importować te ustawienia czy podmienić je standardowymi ustawieniami %s? (możesz też nacisnąć 'Anuluj', aby wyznaczyć inny folder ustawień)
ru_ru: Программа настройки %s нашла старые настройки эмулятора в указанной вами папке. Желаете импортировать эти настройки или перезаписать настройками %s по умолчанию? (нажмите "Отмена" для выбора другой папки)
sv_se: Befintliga %s-Inställningar har hittats i KonfigurationsInställningsMappen. Vill Ni importera dessa Inställningar och överskriva %s's Förval med dem? (eller tryck ''Avbryt'' för att välja en annan Mapp)
th_th: การตั้งค่า %s มีอยู่แล้ว ถูกค้นพบในโฟลเดอร์การตั้งค่าที่กำหนดไว้ คุณต้องการนำเข้าการตั้งค่าหรือว่าเขียนทับพวกมันด้วยค่าตั้งต้น %s ? (หรือกด ยกเลิก เพื่อเลือกโฟลเดอร์การตั้งค่าอื่นๆ)
zh_tw: 在指定的設定檔資料夾發現已經存在的 %s 設定檔。 您想要匯入其中的設定，或以 %s 的預設設定覆寫設定檔？ （或按【取消】選擇一個不同的設定檔資料夾）
