Repository: RPCS3/rpcs3
Catalog: locales/*/pcsx2_Tertiary.po
Languages: sv_se, zh_tw

source: No reason given.
sv_se: Ingen anledning given.
zh_tw: 未給出原因。

source: Threading activity: start, detach, sync, deletion, etc.
sv_se: Trådaktivitet: start, avskiljning, sync, borttagning, etc.
zh_tw: 執行緒的活動：開始、分離、同步、刪除，以及其他。

source: Includes idle event processing and some other uncommon event usages.
sv_se: Inkluderar tomgångshändelsebearbetning och några andra ovanliga händelseanvändningar.
zh_tw: 包含閒置的事件處理和一些其他不尋常的事件使用。

source: The MTGS thread has become unresponsive while waiting for the GS plugin to open.
sv_se: MTGS tråden har blivit osvarandes under inväntningen av att GS-insticksprogrammet ska öppna.
zh_tw: 當等候圖形插件開啟時，多執行緒圖形模式的執行緒停止回應。

source: Internal Memorycard Plugin failed to initialize.
sv_se: Det interna minneskorts-insticksprogrammet misslyckades att initialiseras.
zh_tw: 初始化內部記憶卡插件失敗。

source: Safest
zh_tw: 最安全

source: Safe (faster)
zh_tw: 安全（速度更快）

source: Balanced
zh_tw: 平衡

source: Aggressive
zh_tw: 激進

source: Aggressive plus
zh_tw: 更加激進

source: Mostly Harmful
zh_tw: 基本上有害

source: Fits a lot of log in a microcosmically small area.
zh_tw: 在同等區域中顯示較多日誌

source: It's what I use (the programmer guy).
zh_tw: 這是 PCSX2 程式設計師們使用的字型大小

source: Its nice and readable.
zh_tw: 令人心曠神怡而且便於閱讀

source: In case you have a really high res display.
zh_tw: 適用於高螢幕解析度

source: Default soft-tone color scheme.
zh_tw: 預設的軟色調顏色主題

source: Classic black color scheme for people who enjoy having text seared into their optic nerves.
zh_tw: 經典的黑色主題，獻給喜歡讓文字灼燒視神經的人。

source: When checked the log window will be visible over other foreground windows.
zh_tw: 當勾選時，日誌視窗總是保持在最前端。

source: !ContextTip:ChangingNTFS
sv_se: NTFS komprimering kan ändras manuellt när som helst genom att använda filegenskaper hos Windows Explorer.
zh_tw: NTFS 壓縮能夠在任何時候手動變更，透過從檔案總管使用右鍵選單的「內容」選項。

source: Always use this option if you want the safest and surest memory card behavior.
zh_tw: 如果您想要最安全可靠的記憶卡行為，就一直使用這個選項。

source: 16 and 32 MB cards have roughly the same compatibility factor.
zh_tw: 16 MB 和 32 MB 記憶卡的相容性係數大致相同。

source: Use at your own risk. Erratic memory card behavior is possible (though unlikely).
zh_tw: 使用者自擔風險。可能出現不確定的記憶卡行為（儘管可能性不大）

source: !ContextTip:Folders:Settings
sv_se: Detta är mappen där PCSX2 sparar Era inställningar, och då även inställningar skapade av de flesta insticksprogram (gäller måhända dock inte för vissa äldre insticksprogram).
zh_tw: PCSX2 用這個資料夾儲存您的設定，包括大多數插件的設定。 （一些較老的插件可能不將設定儲存在這個資料夾裡面）

source: !Panel:HasHacksOverrides
sv_se: Varning! Ni kör PCSX2 med instruktionsmöjligheter som kan överskrida Era konfigurationsinställningar. Dessa instruktionsmöjligheter kommer inte att beaktas i Inställningsdialogen, och kommer att förhindras om Ni tillämpar förändringar här.
zh_tw: 警告！您正在從覆寫現有設定的命令列選項執行 PCSX2。 這些命令列選項不會反映到設定視窗中，並且會被停用。 如果您在這裡套用任何變更。

source: !Panel:HasPluginsOverrides
sv_se: Varning! Ni kör PCSX2 med instruktionsmöjligheter som kan överskrida Ert konfigurerade insticksprogram och/eller mappinställningar. Dessa instruktionsmöjligheter kommer inte att beaktas i inställningsdialogen, och kommer att förhindras när Ni tillämpar förändringar här.
zh_tw: 警告！您正在從覆寫現有插件 / 資料夾設定的命令列選項執行 PCSX2。 這些命令列選項不會反映到設定視窗中，並且會被停用。 當您在這裡套用變更時。

source: !Notice:Tooltip:Presets:Slider
sv_se: Förinställningarna tillämpar snabbfixar, några omkompilerarmöjligheter, och några spelfixar som till vetskap höjer hastgheten. Spelfixar ('Patchar') som till vetskap är viktiga kommer att tillämpas automatiskt. Förinställningsinfo: 1 - Den nogrannaste emuleringen, men också den långsammaste. 3 --> Försöker att balansera hastighet med kompabilitet. 4 - Mera aggresiva fixar. 6 - För många fixar kommer troligen att sakta ner de flesta spel.
zh_tw: 1 - 最準確的模擬、速度最慢。 3 --> 嘗試在遊戲速度和相容性之間取得平衡。 4 - 一些更加激進的速度駭客、模擬器選項。 6 - 非常多的速度駭客，可能會降低大多數遊戲的遊戲速度。

source: !Notice:Tooltip:Presets:Checkbox
sv_se: Förinställningarna tillämpar snabbfixar, några omkompilerarmöjligheter, och några spelfixar som till vetskap höjer hastigheten. Spelfixar ('Patchar') som till vetskap är viktiga kommer att tillämpas automatiskt. --> Avmarkera för att modifiera inställningarna manuellt (med nuvarande förinställningar som bas)
zh_tw: 套用速度駭客、一些反編譯選項、一些已知加快遊戲速度的遊戲修正。 已知重要的遊戲修正（補丁）會自動套用。 --> 當取消勾選時，可以手動變更模擬器設定（基於當前滑桿所選擇的預先定義的設置）

source: Logs events as they are passed to the PS2 virtual machine.
sv_se: Loggar händelser medans de skickas till PS2-VM.
zh_tw: 隨著事件傳遞給 PS2 虛擬機，記錄事件。

source: !ContextTip:DirPicker:UseDefault
sv_se: När markerad kommer denna mapp att automatiskt begrunda förvalen assosierade med PCSX2's nuvarande användarinställningar.
zh_tw: 當勾選時，此資料夾將會自動反映與 PCSX2 當前的使用者設定所關聯的預設值。

source: !ContextTip:Window:Vsync
sv_se: Vsync slår ut skärmsönderrivning men har oftast en stor prestationseffekt. Det tillämpar vanligtvis bara i helskärmsläge, och kanske inte fungerar för alla GS insticksprogram.
zh_tw: 垂直同步消除遊戲畫面出現斷層（Screen tearing），但是效能大幅損失。 通常僅用於全螢幕模式，恐怕不是在所有的圖形插件中都能工作。

source: !ContextTip:Window:HideMouse
sv_se: Markera denna för att tvinga muspekaren att bli osynlig när den är i ett GS-fönster; användbart om man har musen som främsta kontroll-mojäng för spelande. Som förval auto-gömmer sig musen efter 2 sekunders inaktivitet.
zh_tw: 當勾選時，強行令滑鼠指標在遊戲視窗中不可見； 對於使用滑鼠作為遊戲中主要的控制裝置，是有用的。 預設，滑鼠指標在 2 秒非活動之後自動隱藏。

source: !ContextTip:Window:Fullscreen
sv_se: Möjliggör automatiskt lägesbyte till fullskärm när emulering statas eller återupptas. Ni kan ännu växla mellan helskärm och fönsterläge genom att trycka Alt + Enter.
zh_tw: 當開始或恢復模擬時，自動切換至全螢幕模式。 您仍能使用 Alt + Enter，在視窗模式和全螢幕模式之間隨時切換。

source: !ContextTip:Window:HideGS
sv_se: Stänger helt det ofta stora och omfångsrika GS-fönstret när Ni trycker på Esc eller avbryter emulatorn.
zh_tw: 當按 ESC 或透過選單「檔案 -> 暫停遊戲」暫停模擬器的模擬時， 暫時徹底關閉又大又笨重的遊戲視窗。

source: !ContextTip:Gamefixes:EE Timing Hack
sv_se: Påverkar till vetskap följande spel: * Digital Devil Saga (Fixar FMV och crashar) * SSX (Fixar dålig grafik och crashar) * Resident Evil: Dead Aim (Orsakar förvrängda texturer)
zh_tw: 已知影響下列遊戲： * 數位惡魔傳說（Digital Devil Saga）（修正遊戲動畫和遊戲當掉） * SSX（修正糟糕的圖形和遊戲當掉） * 惡靈古堡：英雄不死（Resident Evil: Dead Aim）（導致混亂的紋理）

source: !ContextTip:Gamefixes:OPH Flag hack
sv_se: Påverkar till vetskap följande spel: * Bleach Blade Battler * Growlanser II and III * Wizardry
zh_tw: 已知影響下列遊戲： * 死神刀刃戰士（Bleach Blade Battler） * 夢幻騎士（Growlancer）II 和 III * 巫術（Wizardry）

source: !ContextTip:Folders:Savestates
sv_se: I denna mapp sparar PCSX2 sparpunkter, vilka är sparade antingen genom användning av menyer/verktygsrad, eller genom att trycka på F1/F3 (spara/ladda).
zh_tw: PCSX2 用這個資料夾儲存即時存檔； 即時存檔透過「選單 / 工具列」寫入，或熱鍵 F1 / F3（寫檔 / 讀檔）。

source: !ContextTip:Folders:Snapshots
sv_se: I denna mapp sparar PCSX2 skärmbilder. Det faktiska skärmbildsformatet och stilen kan variera beroende på vilket GS-insticksprogram som användes.
zh_tw: PCSX2 用這個資料夾儲存遊戲擷圖。 取決於所使用的圖形插件，實際的圖片格式可能不同。

source: !ContextTip:Folders:Logs
sv_se: I denna mapp sparar PCSX2 sina loggfiler och diagnostiska rapporter. De flesta insticksprogram håller fast vid denna mapp, men dock kan vissa äldre insticksprogram ignorera den.
zh_tw: PCSX2 用這個資料夾儲存日誌和用於診斷的轉存。 大多數插件也使用這個資料夾儲存自己的日誌， 但是一些較老的插件可能忽略這個資料夾。

source: !Panel:Speedhacks:EECycleX1
sv_se: 1 - Förvals cykelgrad. Detta överensstämmer nästan med den faktiska hastigheten hos en PS2 RörelseMotor.
zh_tw: 1 - 預設值。 緊密地匹配正港 PS2 CPU 的實際速度。

source: !Panel:Speedhacks:EECycleX2
sv_se: 2 - Minskar EE's cykelgrad med ungefär 33%. Mild uppsnabbning för de flesta spel med hög kompabilitet.
zh_tw: 2 - 將 EE cyclerate 減少大約 33%。 對於大多數遊戲有溫和的速度提升； 相容性高。

source: !Panel:Speedhacks:EECycleX3
sv_se: 3 - Minskar EE's cykelgrad med ungefär 50%. Måttfull upsnabbning, men *kommer* att orsaka stamningsaudio hos många FMV'er.
zh_tw: 3 - 將 EE cyclerate 減少大約 50%。 適度的速度提升； 許多遊戲動畫的聲音結結巴巴。

source: !Panel:Speedhacks:VUCycleStealOff
sv_se: 0 - Förhndrar VU Cykelstöld. Den mest kompatibla inställningen!
zh_tw: 0 - 停用 VU Cycle Stealing。 相容性最佳！

source: !Panel:Speedhacks:VUCycleSteal1
sv_se: 1 - Mild VU Cykelstöld. Lägre kompabilitet, men en viss uppsnabbning för de flesta spel.
zh_tw: 1 - 溫和的 VU Cycle Stealing。 相容性降低； 對於大多數遊戲能夠提升一些速度。

source: !Panel:Speedhacks:VUCycleSteal2
sv_se: 2 - Måttfull VU Cykelstöld. Ännu lägre kompabilitet, men markant uppsnabbning hos vissa spel.
zh_tw: 2 - 適度的 VU Cycle Stealing。 相容性更低； 對於一些遊戲有巨大的速度提升。

source: !Panel:Speedhacks:VUCycleSteal3
sv_se: 3 - Maximal VU Cykelstöld. Användningen är begränsad, eftersom detta kommer att orsaka synligt flimrande hos de flesta spel.
zh_tw: 3 - 最大的 VU Cycle Stealing。 實用性有限，因為會導致大多數遊戲 畫面閃爍或速度變慢。

source: !ContextTip:Speedhacks:EECycleRate Slider
sv_se: Att sätta ett högre värde för denna glidare minskar verkningsfullt klockhastigheten hos RörelseMotorns R5900 kärn-CPU, och för oftast en hastghetsökning till spel som misslyckas att nyttja möjligheterna med PS2's verkliga hårdvara fullt ut.
zh_tw: 數值愈高，就愈能有效降低 EE 的 CPU 核心 R5900 的時脈。 對於那些無法利用真實 PS2 硬體全部潛能的遊戲，能夠大幅提升遊戲速度。

source: !ContextTip:Speedhacks:VUCycleStealing Slider
sv_se: Denna glidare kontrollerar mängden cykler som VU-enheten stjäl ifrån RörelseMotorn. Högre värden ökar antalet cykler som stjäls från EE'n för varje VU-microprogram spelt kör.
zh_tw: 滑桿控制著 VU 從 EE 偷竊的週期的數目。 數值愈高，遊戲執行的每一個 VU 微程式從 EE 偷的就愈多。

source: !ContextTip:Speedhacks:vuFlagHack
sv_se: Updaterar endast Statusflaggor för block som kommer att läsa dem, isället för alltid. Detta är för det mesta säkert, och Super-VU gör något liknande som standard.
zh_tw: 僅對讀取狀態旗標的塊，更新狀態旗標，取代一直更新狀態旗標。 大部分時間是安全的，Super VU 預設做類似的事情。

source: !ContextTip:Speedhacks:vuBlockHack
sv_se: Förmodar att väldigt långt in i framtiden så kommer block inte behöva gammelflagg-instansdata. Detta borde vara rätt säkert. Det är okänt ifall detta har sönder något spel...
zh_tw: 假定遙遠未來的塊不需要舊的旗標實例資料。 非常安全。不曉得會不會令遊戲不正常...

source: !ContextTip:Speedhacks:vuMinMax
sv_se: Använder SSE's Min/Max Flyttalsoperationer istället för logiska Min/Max rutiner, som annars är brukligt. Känt att förstöra Gran Turismo 4 & Tekken 5.
zh_tw: 使用 SSE 的 Min/Max 浮點操作，取代自訂邏輯 Min/Max 例行程序。 已知令 Gran Turismo 4（GT4）和 Tekken 5（鐵拳 5）遊戲不正常。

source: !ContextTip:Speedhacks:INTC
sv_se: Denna fix fungerar bäst för spel som använder INTC-statusregistret för att invänta vsyncs, vilket i första hand inkluderar icke-3D RPG titlar. Spel som inte använder denna vsync-metod kommer på sin höjd att få en liten uppsnabbning av denna fix.
zh_tw: 對於使用 INTC 狀態暫存器等待垂直同步的遊戲，表現最好。 主要包括 RPG 遊戲非 3D 的標題。 不使用此垂直同步方式的遊戲，將會有少量或沒有速度提升。

source: !ContextTip:Speedhacks:BIFC0
sv_se: I första hand inriktat på EE tomgångs-loop hos adress 0x81FC0 i kärnan, denna fix försöker att upptäcka loopar vars kroppar garanterat resulterar i samma maskintillstånd för varje upprepning tills en schemaläggd händelse utlöser emulering av en annan enhet. Efter en enskild upprepning av en sådan loop, avanserar vi till tiden för nästa händelse eller till slutet av processorns tidskvantum, vilket som än kommer först.
zh_tw: 主要把核心內位址 0x81FC0 的 EE 空閒循環作為目標。 嘗試偵測每次重複都確保導致相同機器狀態的循環， 直到一個排定的事件觸發另一個單元的模擬。 這樣的循環重複一次之後，取決於哪個先到： 我們前進到下次事件或處理器時間片段的結束。

source: !ContextTip:Speedhacks:fastCDVD
sv_se: Kolla HDLaddar-kompabilitetslistan för spel som till vetskap kommer till fråga med det här (ofta markerat som behövande 'läge 1' eller 'långsam DVD').
zh_tw: 查閱 HDLoader 相容性列表，以確定已知使用這個選項會出現問題的遊戲。 通常是有注明需要 mode 1（模式 1）或 slow DVD（慢速 DVD）的遊戲。

source: !ContextTip:Framelimiter:Disable
sv_se: Bemärk att när Bildbegränsning är förhindrad så kommer Turbo och SlowMotion lägena inte att vara tillgängliga heller.
zh_tw: 注意：當畫框限制停用時，渦輪加速和慢動作無法使用。

source: Error while parsing either NTSC or PAL framerate settings. Settings must be valid floating point numerics.
zh_tw: 當解析 NTSC 遊戲或 PAL 遊戲的畫框速率設定時出現錯誤。設定值必須是有效的浮點數。

source: For troubleshooting potential bugs in the MTGS only, as it is potentially very slow.
sv_se: Enbart för att problemlösa eventuella fel inom MTGS, eftersom det möjligen är mycket långsamt.
zh_tw: 僅用於排除多執行緒圖形模式潛在的程式錯誤， 因為速度可能非常慢

source: Completely disables all GS plugin activity; ideal for benchmarking EEcore components.
sv_se: Förhindrar helt all GS-insticksprogramsaktivitet; idealt som utgångspunkt för EE-kärnkomponenter.
zh_tw: 完全停止圖形插件所有的活動； 適合用來做 EEcore 的效能測試

source: !ContextTip:GS:SyncMTGS
sv_se: Möjliggör detta ifall Ni tror att MTGS trådsync orsakar krascher eller grafiska fel.
zh_tw: 啟用這個選項，若您認為多執行緒圖形模式執行緒的同步正在導致模擬器當掉或圖形錯誤。

source: !ContextTip:GS:DisableOutput
sv_se: Tar bort allt norm-oljud orsakat av MTGS-trådens eler GPU'ns överdrag. Denna möjlighet användes bäst i förening med sparpunkter: spara ett tillstånd i en idealisk scen, möjliggör denna möjlighet, och återladda sparpunkten. Varning: Denna möjlighet kan möjliggöras dynamiskt men kan vanligtvis inte förhindras på samma vis (video blir ofta skräp).
zh_tw: 移除任何由多執行緒圖形模式的執行緒過載或 GPU 過載引起的效能測試產生的噪音。 這個選項最好是和即時存檔配合使用： 在一個理想的畫面儲存即時存檔，啟用這個選項，再讀取即時存檔。 警告：這個選項在遊戲運行時啟用即可生效，但無法在遊戲運行時停用（圖像變得垃圾）。

source: !ContextTip:Window:ManagedVsync
sv_se: Möjliggör Vsync när bildfrekvensen är precis på full hastighet. Skulle den falla under denna så förhindras Vsync för att undvika vidare prestandastraff. Bemärk: Detta fungerar för närvarande bara bra med GSdx som GS insticksprogram, och konfigurationen DX10/11 Hårdvarutolkning. Annat insticksprogram eller annat tolkningsläge kommer antigen att ignoreras eller producera en svart skärm som blinkar när läget byts. Det kräver även att Vsync möjliggörs.
