Repository: RPCS3/rpcs3
Catalog: locales/*/pcsx2_Iconized.po
Languages: es_es, it_it, ja_jp, pl_pl, ru_ru, sv_se, th_th, zh_tw

source: This folder is where PCSX2 records savestates; which are recorded either by using menus/toolbars, or by pressing F1/F3 (save/load).
es_es: Esta es la carpeta donde PCSX2 guarda los guardados rápidos; que se almacenan o bien al seleccionarlo en los menús/barras de herramientas, o pulsando F1/F3 (guardar/cargar, respectivamente).
it_it: Questa è la cartella dove PCSX2 registra i salvataggi di stato, che possonoe essere creati utilizzando i menu/barre degli strumenti, o premendo F1/F3 (carica/salva).
ja_jp: PCSX2のセーブステートはこのフォルダーに保存されます。 メインメニューのシステムから、又は「F1」（セーブ）と「F3」（ロード）の ショートカットキーでステート操作を行う事ができます。
pl_pl: Ten katalog mieści w sobie zapisy stanów gier z PCSX2. Korzystasz z nich używając głównego menu lub F1(zapis), F3(odczyt).
ru_ru: Папка, куда PCSX2 будет записывать ваши быстрые сохранения.
sv_se: I denna Mapp sparar PCSX2 Sparpunkter, vilka antingen skapas genom användning av menyer/verktygsrad, eller genom att trycka på ''F1''/''F3'' (Skapa/Ladda).
th_th: โฟลเดอร์นี้ คือตำแหน่งที่ PCSX2 จะบันทึกสถานภาพ; ซึ่งไม่ว่าจะบันทึกโดยใช้ เมนู/แถบเครื่องมือ หรือโดยกด F1/F3 (บันทึก/โหลด)
zh_tw: PCSX2 用這個資料夾儲存即時存檔； 即時存檔透過「選單 / 工具列」寫入，或熱鍵 F1 / F3（寫檔 / 讀檔）。

source: This folder is where PCSX2 saves screenshots. Actual screenshot image format and style may vary depending on the GS plugin being used.
es_es: Esta es la carpeta donde PCSX2 guarda las capturas de pantalla.El formato de imagen y el estilo de las capturas de pantalla cambiará según el plugin GS que se utilice.
it_it: Questa è la cartella dove PCSX2 salva le screenshot. Il formato e le modalità della screenshot dipende dal plugin GS utilizzato.
ja_jp: PCSX2のスクリーンショットはこのフォルダーに保存されます。 実際のスクリーンショットのファイル形式とスタイルは使用しているGSプラグインによって変わります。
pl_pl: Ten katalog mieści w sobie zapisane obrazki, tzw. zrzuty ekranu, ich rozdzielczość i format zależy od użytej wtyczki graficznej.
ru_ru: Папка, куда PCSX2 будет сохранять ваши скриншоты. Форма, размер и стиль скриншотов зависят от используемого плагина.
sv_se: I denna Mapp sparar PCSX2 Skärmbilder. Det faktiska SkärmbildsFormatet och stilen kan variera beroende på vilket GS-InsticksProgram som används.
th_th: โฟลเดอร์นี้ คือตำแหน่งที่ PCSX2 จะบันทึกภาพถ่าย รูปแบบและสไตล์ภาพถ่ายที่แท้จริง อาจแปรเปลี่ยนไปตามปลั๊กอิน GS ที่ถูกใช้
zh_tw: PCSX2 用這個資料夾儲存遊戲擷圖。 取決於所使用的圖形插件，實際的圖片格式可能不同。

source: This folder is where PCSX2 saves its logfiles and diagnostic dumps. Most plugins will also adhere to this folder, however some older plugins may ignore it.
es_es: Esta carpeta es donde PCSX2 guarda sus archivos de registro y sus volcados de diagnóstico.La mayoría de los plugins seguirán esta carpeta, aunque algunos plugins más antiguos pueden ignorarla.
it_it: Questa è la cartella dove PCSX2 salva i file di log e i dump diagnostici. La maggior parte dei plugin salveranno qui i loro log, tuttavia alcuni vecchi plugin potrebbero ignorare questa impostazione.
ja_jp: PCSX2のログ及びダンプファイルはこのフォルダーに保存されます。 プラグインは通常この設定を利用しますが、古いものはこの限りではありません。
pl_pl: Ten katalog służy PCSX2 do zapisywania stanów statusu i zrzutów diagnostycznych. Większość nowych wtyczek również może z tego korzystać.
ru_ru: Данная папка предназначена для сохранения логов и дампов PCSX2. Последние версии плагинов так же используют данную директорию для сохранения разной отладочной информации.
sv_se: I denna Mapp sparar PCSX2 sina loggfiler och diagnostiska rapporter. De flesta InsticksProgram ansluter sig till denna Mapp, men en del äldre kan förbise den.
th_th: โฟลเดอร์นี้ คือตำแหน่งที่ PCSX2 จะบันทึกไฟล์แบบบันทึกข้อมูลและดัมพ์วินิจฉัย ปลั๊กอินส่วนใหญ่จะติดอยู่กับโฟลเดอร์นี้ อย่างไรก็ตามปลั๊กอินเก่าบางอันอาจจะละเลยมัน
zh_tw: PCSX2 用這個資料夾儲存日誌和用於診斷的轉存。 大多數插件也使用這個資料夾儲存自己的日誌， 但是一些較老的插件可能忽略這個資料夾。

source: Warning! Changing plugins requires a complete shutdown and reset of the PS2 virtual machine. PCSX2 will attempt to save and restore the state, but if the newly selected plugins are incompatible the recovery may fail, and current progress will be lost. Are you sure you want to apply settings now?
es_es: ¡Aviso! Cambiar de plugins necesita apagar y reiniciar por completo la máquina virtual de PS2. PCSX2 intentará hacer un guardado rápido y cargarlo, pero si los plugins cambiados no son compatibles la recuperación podría fallar, y se perderán los progresos no guardados. ¿Seguro que quieres aplicar la configuración ahora?
it_it: Attenzione! Dopo aver cambiato i plugin utilizzati è consigliato un completo spegnimento e reset della macchina virtuale PS2. PCSX2 tenterà ora di salvare lo stato e quindi a ripristinarlo, ma se i nuovi plugin selezionati sono incompatibili con quelli precedenti il ripristino potrebbe fallire, facendo perdere tutti i progressi correnti. Sei sicuro di voler applicare adesso le impostazioni?
ja_jp: 警告：プラグインの変更はPS2仮想マシンの完全なシャットダウンとリセットが必要です。 PCSX2はステートセーブを行い、変更されたプラグインでステートの復帰を試行しますが、 互換性が無かった場合は復帰に失敗し、進行中の作業が失われる可能性があります。 本当に設定を適用してもよろしいですか？
pl_pl: Uwaga! Zmiana wtyczek wymaga wyłączenia i ponownego włączenia virtualnej maszyny PS2. PCSX2 spróbuje zapisać i odczytać zapis, lecz jeśli nowo wybrane wtyczki okażą się zawodne obecny stan może zostać utracony. Czy jesteś pewien, że chcesz teraz zachować ustawienia?
ru_ru: Внимание! Смена плагинов требует перезапуска вирутальной машины PS2. Сейчас PCSX2 попробует сохранить текущее состояние и восстановить его с новыми настройками, однако если выбранные вами плагины окажутся несовместимы, данная операция чревата потерей всех данных." Вы действительно хотите продолжить?
sv_se: Varning! Att byta InsticksProgram kräver en full nedstängning och återställning av PS2's Virtuella Maskin. PCSX2 kommer att försöka att spara och återställa tillståndet, men om de nyligen valda InsticksProgramen är oförenliga kan detta misslyckas, och alla nuvarande framsteg går förlorade. Är Ni säker att Ni vill tillämpa ändringarna nu?
th_th: คำเตือน! การเปลี่ยนปลั๊กอินจำเป็นต้องมีการปิดลงอย่างสมบูรณ์และรีเซ็ตเครื่องเสมือน PS2 PCSX2 จะพยายามบันทึกและคืนกลับค่าสถานภาพ แต่ถ้าปลั๊กอินที่เลือกใหม่เข้ากันไม่ได้ การฟื้นฟูอาจจะล้มเหลว และความคืบหน้าในปัจจุบันจะหายไป คุณแน่ใจหรือไม่ที่จะใช้งานการตั้งค่าเดี๋ยวนี้?
zh_tw: 警告！更換插件要求 PS2 虛擬機徹底關閉並重新啟動。 PCSX2 會嘗試儲存並還原目前的遊戲狀態， 但如果新選的插件不相容，遊戲狀態的還原可能會失敗，並丟失目前的遊戲進展。 您確定您想要現在套用變更嗎？

source: All plugins must have valid selections for %s to run. If you are unable to make a valid selection due to missing plugins or an incomplete install of %s, then press Cancel to close the Configuration panel.
es_es: Todos los plugins deben tener una opción válida para que %s funcione. Si no puedes hacer una selección válida porque te falten plugins o la instalación de %s esté incompleta, pulsa en Cancelar para cerrar el panel de configuración.
it_it: Tutti i plugin selezionati devono essere validi per garantire l'esecuzione di %s. Se non sei in grado i fornire delle impostazioni valide a causa di plugin mancanti o un'installazione incompleta di %s premi Annulla per chiudere il pannello di configurazione.
ja_jp: %sを実行するには有効なプラグインを全てについて選択していなければいけません。 プラグインが無かったり、不完全な%sのインストールで、有効な選択ができない場合は キャンセルを押して設定パネルを閉じて下さい。
pl_pl: Zestaw wtyczek musi być kompletny aby %s mógł działać. Jeśli nie jesteś w stanie tego dokonać przez brak jakichkolwiek wtyczek, lub błędną instalację %s wtedy naciśnij 'Anuluj' by zamknąć panel konfiguracji.
ru_ru: Для нормальной работы %s вам необходимо указать и выбрать все доступные плагины. Если вы не можете сделать выбор ввиду отсутствия некоторых плагинов %s, нажмите "Отмена" для выхода из окна настроек.
sv_se: Alla InsticksProgram måste ha giltliga Inställningar för att %s ska kunna köras. Är Ni oförmögen att göra detta till följd av saknade InsticksProgram eller en ofullständig installaion av %s, så tryck ''Avbryt'' för att stänga KonfigurationsDialogen.
th_th: ปลั๊กอินทั้งหมดต้องมีการเลือกใช้ที่ถูกต้องสำหรับการรัน %s ถ้าคุณไม่สามารถเลือกอันที่ถูกต้องเนื่องจากปลั๊กอินสูญหายหรือการติดตั้ง %s ที่ไม่สมบูรณ์ จงกด ยกเลิก เพื่อปิดผังการกำหนดค่า
zh_tw: 為了運行 %s，全部插件都必須具備有效的選擇。 若由於插件丟失或 %s 未能完整安裝，令您無法作出有效的選擇， 那就按【取消】關閉設定視窗。

source: 1 - Default cyclerate. This closely matches the actual speed of a real PS2 EmotionEngine.
es_es: 1 - Tasa de ciclos predeterminada. Es lo más parecido a la velocidad de un EmotionEngine real de PS2.
it_it: 1 - Cyclerate predefinito. Eguaglia accuratamente la velocità dell'EmotionEngine di una vera PS2.
ja_jp: 1 - [デフォルト] PS2実機のEEと同サイクル数（ほぼ同速度）でエミュレーションします。
pl_pl: 1 - Standardowa skala cyklu. Bliska oryginalnej prędkości prawdziwego Silnika Emotion(EE) PS2.
ru_ru: 1 - Стандартное значение скорости работы виртуального процессора PS2 (нет прироста скорости).
sv_se: 1 - Förvalscykelgrad. Detta överensstämmer nästan med den faktiska hastigheten för en PS2-EE.
th_th: 1 - อัตราหมุนตั้งต้น, นี่จะใกล้เคียงกับความเร็วแท้จริงของ EmotionEngine PS2 ของจริง
zh_tw: 1 - 預設值。 緊密地匹配正港 PS2 CPU 的實際速度。

source: 2 - Reduces the EE's cyclerate by about 33%. Mild speedup for most games with high compatibility.
es_es: 2 - Reduce la tasa de ciclos del EE a un 33%. Ligera subida de velocidad para la mayoría de los juegos, y alta compatibilidad.
it_it: 2 - Riduce EE Cyclerate di circa il 33%. Aumento di velocità contenuto per la maggior parte dei giochi mantenendo buona compatibilità.
ja_jp: 2 - EEのサイクルレートを約33%低下させます。速度がそこそこ向上し、互換性も高いです。
pl_pl: 2 - Redukuje cykle EE o około 33%. Średnie przyspieszenie w większości gier i spora kompatybilność.
ru_ru: 2 - понижает цикл работы EE примерно на 33%. Неплохое ускорение для большинства игр, без потери совместимости.
sv_se: 2 - Minskar EE'ns cykelgrad med ungefär 33%. Mild uppsnabbning och hög förenlighet för de flesta spel.
th_th: 2 - ลดอัตราหมุนของ EE ลงราว 33%, ความเร็วเพิ่มขึ้นเล็กน้อย สำหรับเกมส่วนใหญ่ที่มีความเข้ากันได้สูง
zh_tw: 2 - 將 EE cyclerate 減少大約 33%。 對於大多數遊戲有溫和的速度提升； 相容性高。

source: 3 - Reduces the EE's cyclerate by about 50%. Moderate speedup, but *will* cause stuttering audio on many FMVs.
es_es: 3 - Reduce la tasa de ciclos del EE a un 50%. Subida de velocidad moderada, pero causará sonido entrecortado en FMVs.
it_it: 3 - Riduce EE Cyclerate di circa il 50%. Aumento di velocità moderato, ma di sicuro causerà stuttering audio in molti FMV.
ja_jp: 3 - EEのサイクルレートを約50%低下させます。大きく速度が向上しますが、そこそこ互換性が損なわれます。ゲーム内ムービーの音声が乱れる事があります。
pl_pl: 3 - Redukuje cykle EE o około 50%. Przyspiesza w niektórych grach ale może spowodować 'dławienie się' dźwięku w wielu animacjach.
ru_ru: 3 - понижает цикл работы EE примерно на 50%. Хорошее ускорение, чревато возможным заиканием звука.
sv_se: 3 - Minskar EE'ns cykelgrad med ungefär 50%. Måttfull uppsnabbning, men *kommer* att orsaka stamningsljud för många FMV'er.
th_th: 3 - ลดอัตราหมุนของ EE ลงราว 50% ความเร็วเพิ่มขึ้นปานกลาง แต่*จะ*เกิดเสียงตะกุกตะกักบน FMV
zh_tw: 3 - 將 EE cyclerate 減少大約 50%。 適度的速度提升； 許多遊戲動畫的聲音結結巴巴。

source: 0 - Disables VU Cycle Stealing. Most compatible setting!
es_es: 0 - Desactiva el robo de ciclos VU. ¡El ajuste más compatible!
it_it: 0 - Disabilita il VU Cycle Stealing. È l'impostazione più compatibile!
ja_jp: 0 - VU サイクルステアリングを無効にします。最も互換性があります。
pl_pl: 0 - Deaktywuje podkradanie cykli VU. Najbardziej kompatybilne ustawienie!
ru_ru: 0 - VU Cycle Stealing отключен. Наиболее безопасная опция в плане совместимости.
sv_se: 0 - Förhndrar VU-cykelstöld. Den mest förenliga Inställningen!
th_th: 0 - ไม่ใช้การขโมยรอบหมุน VU, การตั้งค่าที่เข้ากันได้โดยส่วนใหญ่
zh_tw: 0 - 停用 VU Cycle Stealing。 相容性最佳！

source: 1 - Mild VU Cycle Stealing. Lower compatibility, but some speedup for most games.
es_es: 1 - Bajo robo de ciclos VU. Baja compatibilidad, pero aumenta la velocidad en algunos juegos.
it_it: 1 - VU Cycle Stealing contenuto. Abbassa la compatibilità, ma garantisce aumenti di velocità per la maggior parte dei giochi.
ja_jp: 1 - 穏やかな設定です。そこそこ速度上昇、互換性が少し損なわれます。
pl_pl: 1 - Drobne podkradanie cykli VU. Niższa kompatybilność, lecz możliwe przyspieszenie w niektórych grach.
ru_ru: 1 - среднее значение VU Cycle Stealing. Может повлиять на совместимость, но при этом ускоряет некоторые игры.
sv_se: 1 - Mild VU-cykelstöld. Lägre förenlighet, men en viss uppsnabbning för de flesta spel.
th_th: 1 - การขโมยรอบหมุน VU แบบอ่อน, เข้ากันได้ต่ำกว่า แต่จะเพิ่มความเร็วสำหรับเกมส่วนใหญ่
zh_tw: 1 - 溫和的 VU Cycle Stealing。 相容性降低； 對於大多數遊戲能夠提升一些速度。

source: 2 - Moderate VU Cycle Stealing. Even lower compatibility, but significant speedups in some games.
es_es: 2 - Robo de ciclos VU moderado. Compatibilidad muy baja, pero aumenta bastante la velocidad en algunos juegos.
it_it: 2 - VU Cycle Stealing moderato. Abbassa ulteriormente la compatibilità, ma porta significativi aumenti di velocità in alcuni giochi.
ja_jp: 2 - 適度な設定です。大きく速度上昇、そこそこ互換性が損なわれます。
pl_pl: 2 - Średnie podkradanie cykli VU. Jeszcze niższa kompatybilność, lecz spore przyspieszenia w niektórych grach.
ru_ru: 2 - высокое значение VU Cycle Stealing. Наверняка скажется на совместимости, окупается неплохим ускорением эмуляции.
sv_se: 2 - Måttfull VU-cykelstöld. Ännu lägre förenlighet, men en markant uppsnabbning för vissa spel.
th_th: 2 - การขโมยรอบหมุน VU ปานกลาง, ความเข้ากันได้ต่ำพอกัน แต่จะเพิ่มความเร็วอย่างมีนัยสำคัญสำหรับบางเกม
zh_tw: 2 - 適度的 VU Cycle Stealing。 相容性更低； 對於一些遊戲有巨大的速度提升。

source: 3 - Maximum VU Cycle Stealing. Usefulness is limited, as this will cause flickering visuals or slowdown in most games.
es_es: 3 - Robo de ciclos VU máximo. No sirve de mucho, provoca gráficos parpadeantes o ralentizará casi todos los juegos.
it_it: 3 - VU Cycle Stealing massimo. L'utilità è limitata dato che causa visuali traballanti o rallentamenti nella maggior parte dei giochi.
ja_jp: 3 - 最大限の設定です。利用価値は低く、ほとんどのゲームでは画面のチラつき、速度低下等が発生します。
pl_pl: 3 - Maksymalne podkradanie cykli VU. Przydatność ograniczona, gdyż może powodować znaczne spadki prędkości i inne graficzne udziwnienia w wielu grach.
ru_ru: 1 - максимальное значение VU Cycle Stealing. В этом режиме будет проявляться множество графических багов.
sv_se: 3 - Maximal VU-cykelstöld. Begränsad användning, eftersom tillämpning orsakar synligt flimrande för de flesta spel.
th_th: 3 - การขโมยรอบหมุน VU มากที่สุด, ประโยชน์มีจำกัด จะทำให้เกิดการมองเห็นแบบหรี่ กระพริบ หรือช้าลงในเกมส่วนใหญ่
zh_tw: 3 - 最大的 VU Cycle Stealing。 實用性有限，因為會導致大多數遊戲 畫面閃爍或速度變慢。

source: Speedhacks usually improve emulation speed, but can cause glitches, broken audio, and false FPS readings. When having emulation problems, disable this panel first.
es_es: Los arreglos de velocidad generalmente mejoran la velocidad de la emulación, pero pueden provocar fallos gráficos, sonido entrecortado, y falsas lecturas de FPS. Si tienes problemas de emulación, empieza por desactivar este panel.
it_it: Generalmente gli SpeedHack consentono di migliorare la velocità dell'emulazione, ma possono causare glitch, audio corrotto e rilevazioni FPS non corrette. Se hai problemi di emulazione, per prima cosa disattiva le opzioni in questo pannello.
ja_jp: スピードハックはエミュレーション速度を向上させますが、不具合、音声の乱れや不正確なFPSを表示する事があります。 エミュレーションについて問題が発生した時は、まずはこのパネルの設定を無効にしてみて下さい。
pl_pl: Łatki przyspieszające, zwykle usprawniają prędkość emulacji, mogą jednak powodować błędy graficzne, dźwiękowe a także błędne odczyty FPS. Podczas wystąpienia jakichkolwiek błędów, zacznij od wyłączenia tego panelu.
ru_ru: Спидхаки позволяют вам ускорить эмуляцию той или иной игры, но в большинстве случаев вам придется расплачиваться за скорость различными багами, испорченным звуком, некорректными значениями FPS. При наличии каких-либо критичных проблем - первым делом отключите ВСЕ спидхаки.
sv_se: Uppsnabbningshackar förbättrar vanligtvis emuleringshastigheten, men kan orsaka trassel, brutet ljud, och falska FPS-avläsningar. Spärra denna panel det första Ni gör vid emuleringsproblem.
th_th: Speedhack มักจะเพิ่มความเร็วของการจำลอง แต่อาจทำให้เกิดความบกพร่อง เสียงแตก และ การอ่านอัตราเฟรม (FPS) ผิดพลาด เมื่อการจำลองเกิดปัญหาให้เลือกไม่ใช้งานผังนี้เป็นอันดับแรก
zh_tw: 速度駭客通常會提升遊戲速度，但可能導致遊戲出現小毛病、破損的聲音、錯誤的 FPS 顯示。 當遊戲出現問題時，首先停用速度駭客。

source: Setting higher values on this slider effectively reduces the clock speed of the EmotionEngine's R5900 core cpu, and typically brings big speedups to games that fail to utilize the full potential of the real PS2 hardware.
es_es: Si asignas un valor alto con esta opción reducirás la velocidad de reloj real de la CPU del núcleo R5900 del EmotionEngine, y generalmente aumenta la velocidad de los juegos que no saben utilizar el verdadero potencial del hardware de PS2 real.
it_it: Impostando i valori più elevati di questo slider di fatto si riduce la frequenza della CPU core R5900 dell'EmotionEngine portando a grossi aumenti di velocità in quei giochi che non riescono ad utilizzare il pieno potenziale dell'hardware della PS2.
ja_jp: 設定値を高くする程、EEのR5900 CPUのクロックを低下させます。PS2のハードウェア能力を最大限に利用していないゲームで大幅に速度が向上します。
pl_pl: Ustawienie wyższych wartości na tym wskaźniku efektywnie redukuje prędkość procesora R5900 silnika Emotion(EE), możliwie przyspieszając działanie niektórych gier, które nie są w stanie w pełni wykorzystać prędkości konsoli PS2.
ru_ru: Позволяет последовательно понизить цикл работы EmotionEngine процессора эмулируемой машины и тем самым ускорить игры, которые не полностью используют аппаратные ресурсы PS2.
sv_se: Att sätta ett högre värde genom denna manick minskar verkningsfullt klockhastigheten hos EE'ns R5900 kärn-CPU, och ger oftast en hög hastghetsökning åt spel som är oförmögna att nyttja möjligheterna med PS2's verkliga hårdvara fullt ut.
th_th: การตั้งค่าที่สูงขึ้นบนตัวเลื่อนนี้ มีผลลดความเร็วนาฬิกา R5900 core cpu ของ EmotionEngine และมักนำความเร็วที่สูงขึ้นมากมาสู่เกม แต่จะล้มเหลว ในการใช้ประโยชน์ให้เต็มสมรรถนะฮาร์ดแวร์ PS2 ของจริง
zh_tw: 數值愈高，就愈能有效降低 EE 的 CPU 核心 R5900 的時脈。 對於那些無法利用真實 PS2 硬體全部潛能的遊戲，能夠大幅提升遊戲速度。

source: This slider controls the amount of cycles the VU unit steals from the EmotionEngine. Higher values increase the number of cycles stolen from the EE for each VU microprogram the game runs.
es_es: Este deslizador controla la cantidad de ciclos que la unidad VU quita al EmotionEngine. Un valor alto aumenta el número de ciclos robados del EE a cada microprograma del VU que utiliza el juego.
it_it: Questo slider controlla l'ammontare di cicli che l'unità VU 'ruba' all'EmotionEngine. Valori più alti aumentano il numero di cicli 'rubati' dall'EE per ogni microprogramma VU eseguito dal gioco.
ja_jp: VUがEEから奪うサイクルを増減させます。値が高いほどVUプログラム数に応じてEEから奪うサイクルが増加します。
pl_pl: Ten wskaźnik kontroluje ilość cykli graficznej jednostki silnika EE. Wyższe wartości zwiększają ilość skradzionych cykli używanych na każdy mikroprogram uruchamiany przez grę.
ru_ru: Позволяет настроить количество циклов, "воруемых" VU-юнитом у EmotionEngine. Более высокое значение хака увеличивает количество циклов, которые будут "позаимствованы" у EE для обработки микропрограмм VU.
sv_se: Denna manick styr mängden cykler som VU-enheten stjäl ifrån EE'n. Högre värden ökar antalet cykler som stjäls från EE'n för varje microVU program spelet kör.
th_th: ตัวเลื่อนนี้จะควบคุมจำนวนรอบหมุนหน่วย VU ที่ขโมยจาก EmotionEngine ค่าที่สูงกว่าจะเพิ่มการขโมยรอบหมุนจาก EE สำหรับแต่ละ VU microprogram ที่เกมรัน
zh_tw: 滑桿控制著 VU 從 EE 偷竊的週期的數目。 數值愈高，遊戲執行的每一個 VU 微程式從 EE 偷的就愈多。

source: Updates Status Flags only on blocks which will read them, instead of all the time. This is safe most of the time, and Super VU does something similar by default.
es_es: Actualiza las etiquetas de estado sólo en los bloques que podrán leerse, en lugar de hacerlo constantemente. Generalmente es la opción más segura, y Super VU ya hace algo parecido de forma predeterminada.
it_it: Le Flag di stato saranno aggiornate solo nei blocchi che le leggeranno, invece che ogni volta. Questo va bene per la maggior parte dei casi e superVU fa qualcosa del genere in maniera predefinita.
ja_jp: 常に読み込むのでは無く、読み込まれるブロックのステータスフラグのみをアップデートします。 ほぼ安全に使う事ができ、Super VUもデフォルトで同じような動作をします。
pl_pl: Uaktualnia Flagi Statusu tylko na blokach, które je odczytują zamiast cały czas. Jest to bezpieczne w większości przypadków, SuperVU robi coś podobnego w standardzie.
ru_ru: Обновляет флаги состояния только на тех блоках, которые будут читать данные флаги (вместо постоянного обновления всех блоков). Вполне безопасный хак, SuperVU-рекомпилятор делает нечто подобное по-умолчанию.
sv_se: Uppdaterar endast Statusflaggor för block som kommer att läsa dem, istället för alltid. Detta är för det mesta säkert, och superVU gör något liknande som standard.
th_th: อัพเดต Status Flags บนบล็อคที่จะอ่านพวกมันเท่านั้น แทนที่จะทำทุกเวลา นี่มีความปลอดภัยของเวลามากที่สุด และ SuperVU ก็ทำบางสิ่งที่คล้ายกันเป็นค่าตั้งต้น
zh_tw: 僅對讀取狀態旗標的塊，更新狀態旗標，取代一直更新狀態旗標。 大部分時間是安全的，Super VU 預設做類似的事情。

source: Runs VU1 on its own thread (microVU1-only). Generally a speedup on CPUs with 3 or more cores. This is safe for most games, but a few games are incompatible and may hang. In the case of GS limited games, it may be a slowdown (especially on dual core CPUs).
es_es: Ejecuta VU1 en un hilo dedicado (sólo microVU1). Suele aumentar la velocidad en CPUs de tres núcleos o más. Opción segura para la mayoría de los juegos, pero algunos no son compatibles y pueden bloquear el emulador. En el caso de los juegos limitados por GS, podría ralentizarlos (sobre todo en CPUs de doble núcleo).
it_it: Esegue la VU1 in un thread separato (solo la microVU1). Generalmente si ottiene un aumento di velocità su CPU con 3 o più core. La maggior parte dei giochi non crea problemi, ma alcuni sono incompatibli e possono andare in stallo. Si possono invece verificare dei rallentamenti (specialmente con CPU dual-core) nel caso di giochi limitati dal thread GS .
ja_jp: VU1を独自のスレッドで実行します（microVU1のみ）。一般的に3コア以上のCPUで速度が向上します。互換性の低下もほぼありませんが、フリーズする可能性があります。
pl_pl: Dodaje osobny wątek dla VU1(działa tylko z microVU1). Najczęściej oznacza to przyspieszenie dla komputerów z 3 lub więcej rdzeniami, może jednak w niektórych grach prowadzić do niestabilności i wieszania się emulacji. Na gry ograniczone wątkiem GS może to mieć odwrotny skutek, szczególnie przy 2-rdzeniowych procesorach.
sv_se: Kör VU1 i dess egna tråd (endast microVU1). I allmänhet en uppsnabbning för CPU'er med 3 eller fler kärnor. Detta är säkert för de flesta spel, men en del är oförenliga och kan hänga. För GS-begränsade spel kan en nedbromsning förekomma (i synnerhet med dubbelkärniga CPU'er).
zh_tw: microVU1 獨佔一個執行緒。對於 3 核或更多核的 CPU，通常會提升遊戲速度。 對於大多數遊戲是安全的。但是少數遊戲不相容可能會遊戲停止回應。 對顯示卡要求高的遊戲，可能會降低遊戲速度（尤其在雙核心 CPU 上）。
