Repository: RPCS3/rpcs3
Catalog: locales/*/pcsx2_Iconized.po
Languages: es_es, it_it, ja_jp, pl_pl, ru_ru, sv_se, th_th, zh_tw

source: Zoom = 100: Fit the entire image to the window without any cropping. Above/Below 100: Zoom In/Out 0: Automatic-Zoom-In untill the black-bars are gone (Aspect ratio is kept, some of the image goes out of screen). NOTE: Some games draw their own black-bars, which will not be removed with '0'. Keyboard: CTRL + NUMPAD-PLUS: Zoom-In, CTRL + NUMPAD-MINUS: Zoom-Out, CTRL + NUMPAD-*: Toggle 100/0
es_es: Zoom = 100: Encaja toda la imagen a la ventana sin recortarla. Por encima o debajo de 100: Aumentar o reducir el zoom sobre la imagen 0: Zoom automático hasta eliminar las barras negras (Se mantiene la proporción, parte de la imagen se sale de la pantalla). NOTA: Algunos juegos crean sus propias barras negras, que no se eliminarán usando '0'. Teclado: CTRL + TECL.NÚM.MÁS: Aumentar el zoom, CTRL + TECL.NÚM.MENOS: Reducir el zoom, CTRL + TECL.NÚM.MULTIPLICAR: Cambiar entre 100 y 0
it_it: Zoom = 100: L'immagine riempie l'intera finestra senza essere ritagliata. Al di sopra/sotto di 100: Aumenta/diminuisce lo Zoom 0: Zoom automatico affinche siano rimossi i bordi neri (la proporzione aspetto viene mantenuta, parte dell'immagine potrebbe essere fuori dallo schermo). NOTA: Alcuni giochi possono disegnare i propri bordi neri, che non saranno rimossi con '0'. Scorciatoie da tastiera : CTRL + Più (tast. num.) : Aumenta Zoom, CTRL + Meno (tast. num.): Diminuisci Zoom, CTRL + * (tast. num.): Scambia i valori '100' e '0'
ja_jp: ズーム率が100の場合、映像出力をクロッピング（トリミング）せず、画面に合わせて伸縮します。 100より低い場合はズームイン、高い場合はズームアウトします。0の場合は自動ズームインで黒い枠を消します（アスペクト比を保ちますが、多少外にでる事があります）。 メモ：一部のゲームでは黒枠を描画する事があり、値を0に設定しても消えません。 ショートカットキー： [CTRL] + [＋]でズームイン、[CTRL] + [－]でズームアウト、[CTRL] + [*]でズーム値100/0切り替え（＋－*はテンキーを使用）
pl_pl: Zbliżenie = 100: Mieści cały obraz w oknie bez ucinania. Powyżej/Poniżej 100: Przybliżenie/Oddalenie 0: Automatyczne zbliżenie aż do momentu gdy czarne paski znikną całkowicie, proporcje są zachowane niektóre części obrazu mogą przez to wyjść poza widoczny ekran. Uwaga: Niektóre gry rysują swoje własne "czarne paski", które nie będą usunięte przez '0'. Skrót: CTRL+NUMPAD-PLUS: Zbliżenie, CTRL+NUMPAD-MINUS: Oddalenie, CTRL+NUMPAD-*: przełącza 100/0
sv_se: Zoom = 100.00: Anpassa hela bilden till fönstret utan beskärning; Över/Under 100.00: Zooma in/ut. Bemärk: Zoom-värdet återställs inte automatiskt; det sparas i konfigurationsfilen, och tillämpas nästa gång Ni använder PCSX2. Zoom = 0.00: Automatisk inzoomning tills de svarta räckena är borta (bildkvot bevaras, en del av bilden går utanför fönstret). Bemärk: Vissa spel ritar sina egna svarta räcken vilka inte tas bort med ''0.00''. Tangentbord: ''Ctrl'' + ''NumPad Plus'': Inzoomning ''Ctrl'' + ''NumPad Minus'': Utzoomning ''Ctrl'' + ''NumPad Stjärna'': Växla 100/0
th_th: ขยาย = 100 ทำภาพทั้งหมดให้พอดีกับหน้าต่างโดยปราศจากการตัดภาพ มากกว่า/ต่ำกว่า 100: ซูมเข้า/ซูมออก 0: ซูมเข้าอัตโนมัติจนกระทั่งแถบสีดำหายไป (ยังคงสัดส่วนภาพ บางส่วนอาจจะหลุดออกนอกจอ) หมายเหตุ: บางเกมสร้างแถบสีดำขึ้นมาเอง ซึ่งจะไม่สามารถเอาออกได้โดยใช้ '0' แป้นพิมพ์: Ctrl + ปุ่มเครื่องหมายบวก: ซูมเข้า, Ctrl + ปุ่มเครื่องหมายลบ: ซูมออก, Ctrl + ปุ่มดอกจัน: สลับ 100/0
zh_tw: 100：畫面不縮放 大於 100：畫面放大；小於 100：畫面縮小 0：自動放大畫面直到黑邊消失（保持畫面比例，部分畫面放大至顯示範圍外無法顯示） 注意：一些遊戲畫面本身自帶黑邊，這樣的黑邊無法透過數值設定為 0 來移除 鍵盤熱鍵：Ctrl + Num+ 畫面放大；Ctrl + Num- 畫面縮小；Ctrl + Num * 切換 100 / 0

source: Vsync eliminates screen tearing but typically has a big performance hit. It usually only applies to fullscreen mode, and may not work with all GS plugins.
es_es: La sincronía vertical elimina las imágenes cortadas, pero normalmente reduce el rendimiento. Sólo se aplica normalmente al modo en pantalla completa, y no podría funcionar con todos los plugins GS.
it_it: La sincronia verticale elimina il tearing dello schermo ma di solito ha un forte impatto sulle prestazioni. Normalmente viene applicata alla sola modalità a schermo intero e potrebbe non funzionare con tutti i plugin GS.
ja_jp: Vsync （垂直同期）は画面の水平な乱れ（ティアリング）を除去しますが、パフォーマンスに悪影響を及ぼします。 フルスクリーン時に適用され、全てのGSプラグインで動作しないことがあります。
pl_pl: Synchronizacja pionowa, eliminuje 'rwania' obrazu, ale ma zwykle sporą zasługę do pomniejszenia ilości klatek animacji. Zwykle działa tylko w trybie pełnoekranowym i nie z każdą wtyczką graficzną.
ru_ru: Устраняет "излом" изображения при активной смене картинки на экране, однако сия роскошь чревата общим понижением производительности. Актуально лишь при использовании полноэкранного режима и лишь в связке с теми видео-плагинами, которые его поддерживают.
sv_se: Vsync slår ut skärmsönderrivning men har oftast en stor prestationseffekt. Det tillämpas vanligtvis bara i Helskärmsläge, och kanske inte fungerar för alla GS-InsticksProgram.
th_th: Vsynce กำจัดการฉีกของจอภาพ แต่มักจะกระทบสมรรถนะอย่างใหญ่หลวง มันมักถูกใช้เฉพาะโหมดเต็มจอ และอาจใช้ไม่ได้ผลกับทุกปลั๊กอิน
zh_tw: 垂直同步消除遊戲畫面出現斷層（Screen tearing），但是效能大幅損失。 通常僅用於全螢幕模式，恐怕不是在所有的圖形插件中都能工作。

source: Enables Vsync when the framerate is exactly at full speed. Should it fall below that, Vsync gets disabled to avoid further performance penalties. Note: This currently only works well with GSdx as GS plugin and with it configured to use DX10/11 hardware rendering. Any other plugin or rendering mode will either ignore it or produce a black frame that blinks whenever the mode switches. It also requires Vsync to be enabled.
es_es: Activa la sincronía vertical cuando la velocidad de fotogramas vaya a la velocidad normal. Si se reduce la velocidad, la sincronía vertical se desactivará para evitar problemas de rendimiento. Nota: Este modo sólo funciona bien con el plugin GSdx configurado para utilizar renderizado por hardware DX10/11. Cualquier otro plugin o modo de renderizado ignorará esta opción o mostrará una ventana negra que parapadeará al cambiar el modo. También necesita que la sincronía vertical esté activada.
it_it: Abilita la sincronia verticale quando la frequenza fotogrammi è esattamente alla velocità corretta. Dovesse scendere al di sotto della velocità corretta, la sincronia verticale sarà disattivata per evitare ulteriori penalità alle prestazioni. Attenzione: Attualmente questa opzione funziona bene con il plugin GS GSdx configurato per utilizzare il rendering hardware DX10/11. Qualsiasi altro plugin ignorerà questa opzione o produrrà un fotogramma nero che farà lampeggiare lo schermo al cambio di modalità. Richiede inoltre che la Sincronia Verticale sia abilitata.
ja_jp: フレームレートがフルスピードに達している時は自動で垂直同期を有効にし、スピードが落ちるとパフォーマンスを保つために自動で無効になります。 メモ：現時点ではGSdxプラグインをDX 10/11のハードウェアモードにしている場合のみ正常に動作します。他のプラグインやレンダリングモードで使うと 認識しなかったり垂直同期のオン、オフが切り替わる際に黒画面になったりします。垂直同期も有効にしなければなりません​。
pl_pl: Aktywuje synchronizację pionową kiedy klatki animacji są uzyskują pełnię dla wybranego standardu. Jeśli spadnie poniżej, synchronizacja pionowa zostaje wyłączona aby pominąć dalsze spadki wydajności. Uwaga: Działa tylko z wtyczką GSdx w trybie sprzętowym DX10/11. Wszelkie inne wtyczki lub tryby renderowania, zignorują tę opcję, lub stworzą czarną klatkę animacji za każdym razem gdy powinno nastąpić przejście między trybami. Opcja ta wymaga włączonej synchronizacji pionowej.
ru_ru: Включает режим вертикальной синхронизации (Vsync) когда скорость смены кадров происходит на полной мощности. В случае падения ниже этой скорости, синхронизация отменяеться дабы избежать падения производительности. Примечание: На данный момент это хорошо работает с плагинами GSdx и GS настроенными на использование DX10/11 с рендерингом при помощи "железа". Любой другой плагин или вид рендеринга будет игнорировать это или будет выдавать черный кадр каждый раз когда происходит переключение режимов.
sv_se: Möjliggör Vsync när bildfrekvensen är precis på full hastighet. Skulle den falla under denna så spärras Vsync för att undvika vidare prestandastraff. Bemärk: Detta fungerar för närvarande bara bra med GSdx som GS-InsticksProgram, och med konfigurationen DX10/11 Hårdvaruframställning. Annat InsticksProgram eller framställningssätt kommer antingen att förbises eller alstra en svart skärm som blinkar när läget byts. Tillämpningen kräver även att Vsync möjliggörs.
th_th: ใช้งาน Vsync เมื่ออัตราเฟรมมีความเร็วเต็มที่แน่นอน การตกลงต่ำกว่านั้น, Vsync จะไม่ได้รับการใช้งานเพื่อหลีกเลี่ยงโทษต่อสมรรถนะที่จะมีต่อ ๆ ไป หมายเหตุ: นี่จะได้ผลดีเฉพาะกับปลั๊กอิน GS คือ GSdx และกับการกำหนดค่าให้ใช้มันกับตัวนำแสดงผลฮาร์ดแวร์ DX10/11 ปลั๊กอินอื่นหรือโหมดแสดงผลอื่นจะละเลยมันไป หรือแสดงเฟรมสีดำกระพริบเมื่อไหร่ก็ตามที่สลับโหมด มันต้องการให้ Vsync ถูกใช้งานด้วย
zh_tw: 當擁有正常的遊戲速度時，開啟垂直同步。 若達不到正常的遊戲速度，就關閉垂直同步以避免遊戲速度進一步下降。 注意：僅用於 GSdx 的 Renderer 設定為 Direct3D10/11 (Hardware)。 任何其他的圖形插件或 GSdx 的 Renderer 設定將會忽略本選項， 或在切換垂直同步時，出現閃爍的黑色框架。 本選項也要求開啟顯示卡的垂直同步。

source: Check this to force the mouse cursor invisible inside the GS window; useful if using the mouse as a primary control device for gaming. By default the mouse auto-hides after 2 seconds of inactivity.
es_es: Activa esta opción para forzar que el cursor del ratón sea invisible dentro de la ventana GS; es útil si utilizas tu ratón como mando de control. Por defecto el ratón se esconde automáticamente tras dos segundos de inactividad.
it_it: Spunta questa opzione per forzare l'invisibilità del cursore all'interno della finestra GS. Utile se impieghi il mouse come periferica di controllo principale nei giochi. Per impostazione predefinita il mouse viene nascosto automaticamente dopo due secondi di inattività.
ja_jp: ゲーム画面内に入ったマウスポインターを非表示にします。 主にマウスをコントローラーとして利用している時に便利です。 デフォルトでカーソルが2秒間動かないと自動的に隠れます。
pl_pl: Zaznacz tą opcję aby wymusić ukrywanie kursora myszy w oknie wtyczki graficznej; użyteczne gdy używamy myszy jako głównego kontrolera w grze. Standardowo kursor myszy chowa się po 2 sekundach braku aktywności.
ru_ru: По умолчанию, курсор мыши скрывается после 2-ух секунд бездействия. Данная опция моментально скрывает курсор мыши в видеоокне. Удобно, если вы используете управление мышью в игре.
sv_se: Markera för att få Muspekaren att döljas när den är i ett GS-fönster; användbart vid brukande av musen som främsta styrmojäng för spelande. Som praxis gömmer sig Muspekaren automatiskt efter 2 sekunders inaktivitet.
th_th: ทำเครื่องหมายสิ่งนี้ เพื่อบังคับให้ไม่เห็นเคอร์เซอร์ของเม้าส์ในหน้าต่าง GS; มีประโยชน์ถ้าใช้เม้าส์เป็นตัวควบคุมหลักสำหรับเกม โดยค่าตั้งต้น เม้าส์จะถูกซ่อนอัตโนมัติ หลังจากการไม่มีกิจกรรมใด ๆ 2 วินาที"
zh_tw: 當勾選時，強行令滑鼠指標在遊戲視窗中不可見； 對於使用滑鼠作為遊戲中主要的控制裝置，是有用的。 預設，滑鼠指標在 2 秒非活動之後自動隱藏。

source: Enables automatic mode switch to fullscreen when starting or resuming emulation. You can still toggle fullscreen display at any time using alt-enter.
es_es: Activa el cambio automático a pantalla completa al iniciar o reanudar la emulación. Podrás activar la pantalla completa en cualquier momento pulsando Alt+Intro.
it_it: Abilita il passaggio automatico alla modalità a schermo intero quando si avvia o si riprende l'emulazione. È possibile passare in qualunque momento dalla modalità a schermo intero a finestra e viceversa utilizzando Alt+Invio.
ja_jp: エミュレーション中と再開時に自動でフルスクリーンにする機能を有効にします。[ALT] + [Enter]のショートカットでいつでも切り替える事ができます。
pl_pl: Pozwala na automatyczne przejście na pełny ekran podczas kontynuowania zawieszonej emulacji. Nadal możesz przełączać tryby kiedy zechcesz używając alt+enter.
ru_ru: Автоматически переводит видеоокно в полный режим при запуске игры. Впрочем, вы всегда можете выйти из данного режима с помощью комбинации ALT+ENTER.
sv_se: Möjliggör automatiskt lägesbyte till Helskärm när emulering börjar eller återupptas. Ni kan fortfarande växla mellan Helskärm och Fönsterläge genom att trycka ''Alt'' + ''Enter''.
th_th: ใช้โหมดอัตโนมัติเพื่อสลับไปเต็มจอเมื่อเริ่มต้น หรือทำการจำลองต่อจากเดิม คุณสามารถสลับการแสดงผลเต็มจอเวลาใดก็ได้โดยกด Alt-Enter
zh_tw: 當開始或恢復模擬時，自動切換至全螢幕模式。 您仍能使用 Alt + Enter，在視窗模式和全螢幕模式之間隨時切換。

source: Completely closes the often large and bulky GS window when pressing ESC or pausing the emulator.
es_es: Cierra por completo la a menudo enorme y molesta ventana de GS al pulsar ESC o al pausar el emulador.
it_it: Con questa opzione la finestra GS, che occupa spazio e consuma risorse, sarà chiusa automaticamente quando si preme ESC o si mette in pausa l'emulazione.
ja_jp: ESCを押すか、エミュレーションを中断した時にGSウィンドウを非表示にする機能です。 ウィンドウが大きいと作業の邪魔になりやすいので、このオプションは便利です。
pl_pl: W pełni zamyka obraz emulacji po naciśnięciu ESC lub zatrzymaniu emulacji.
ru_ru: Скрывает видеоокно при установке паузы или нажатии ESC.
sv_se: Stänger helt det ofta stora och omfångsrika GS-fönstret när Ni trycker på ''Esc'' och/eller pausar emulatorn.
th_th: ปิดหน้าต่าง GS ที่ใหญ่โตบ่อยๆ อย่างสมบูรณ์ เมื่อกด ESC หรือพักตัวจำลอง
zh_tw: 當按 ESC 或透過選單「檔案 -> 暫停遊戲」暫停模擬器的模擬時， 暫時徹底關閉又大又笨重的遊戲視窗。

source: Known to affect following games: * Digital Devil Saga (Fixes FMV and crashes) * SSX (Fixes bad graphics and crashes) * Resident Evil: Dead Aim (Causes garbled textures)
es_es: Se sabe que afecta a los siguientes juegos: * Digital Devil Saga (Arregla los vídeos FMV y sus cierres repentinos) * SSX (Arregla los gráficos dañados y sus cierres repentinos) * Resident Evil: Dead Aim (Provoca gráficos deformados)
it_it: Ha effetto in questi giochi: * Digital Devil Saga (corregge FMV e crash) * SSX (corregge errori nella grafica e crash) * Resident Evil: Dead Aim (causa texture alterate)
ja_jp: 以下のゲームに役立ちます： * デジタルデビルサーガ（ゲーム内ムービーとクラッシュを修正します） * SSX（グラフィックとクラッシュを修正します） * ガンサバイバー４ バイオハザードヒーローズネバーダイ（グラフィックがおかしくなります）
pl_pl: Znane z wpływu na następujące gry: Digital Devil Saga (naprawia animację i zwisy) SSX (Naprawia zwisy i błędy graficzne) Resident Evil: Dead Aim (wytwarza błędy graficzne)
ru_ru: Актуален для следующих игр: * Digital Devil Saga (исправляет видеозаставки и вылеты) * SSX (исправляет графические ошибки и вылеты) * Resident Evil: Dead Aim (исправляет неправильные текстуры)
sv_se: Påverkar till vetskap följande spel: * ''Digital Devil Saga'' (fixar FMV'er och krascher) * ''SSX'' (fixar dålig grafik och krascher) * ''Resident Evil: Dead Aim'' (orsakar förvrängda texturer)
th_th: ทราบว่าจะมีผลต่อเกมต่อไปนี้: * Digital Devil Saga (แก้ปัญหา FMV และการขัดข้อง) * SSX (แก้ปัญหากราฟิกที่แย่และการขัดข้อง) * Resident Evil: Dead Aim (เกิดภาพบิดเบือน)
zh_tw: 已知影響下列遊戲： * 數位惡魔傳說（Digital Devil Saga）（修正遊戲動畫和遊戲當掉） * SSX（修正糟糕的圖形和遊戲當掉） * 惡靈古堡：英雄不死（Resident Evil: Dead Aim）（導致混亂的紋理）

source: Known to affect following games: * Bleach Blade Battler * Growlanser II and III * Wizardry
es_es: Se sabe que afecta a los siguientes juegos: * Bleach Blade Battler * Growlanser II y III * Wizardry
it_it: Ha effetto in questi giochi: * Bleach Blade Battler * Growlanser II e III * Wizardry
ja_jp: 以下のゲームに役立ちます： * ブリーチブレイドバトラーズ * グローランサーII、III * ウィザードリィ
pl_pl: Znane z wpływu na następujące gry: Bleach Blade Battler Growlanser II and III Wizardy
ru_ru: Актуален для следующих игр: * Bleach Blade Battler * Growlanser II and III * Wizardry"
sv_se: Påverkar till vetskap följande spel: * ''Bleach Blade Battler'' * ''Growlanser II & III'' * ''Wizardry''
th_th: ทราบว่าส่งผลต่อเกมต่อไปนี้: * Bleach Blade Battler * Growlanser II และ III * Wizardry
zh_tw: 已知影響下列遊戲： * 死神刀刃戰士（Bleach Blade Battler） * 夢幻騎士（Growlancer）II 和 III * 巫術（Wizardry）

source: Known to affect following games: * Mana Khemia 1 (Going "off campus")
es_es: Se sabe que afecta a los siguientes juegos: * Mana Khemia 1 (Al salir "fuera del campus")
it_it: Ha effetto in questi giochi: * Mana Khemia 1 (Going "off campus")
ja_jp: 以下のゲームに役立ちます： * マナケミア～学園の錬金術士たち～ * メタルサーガ
pl_pl: Znane z wpływu na następujące gry: Mana Khemia 1 (Going "off campus")
ru_ru: Актуален для следующих игр: * Mana Khemia 1 ("выходя за пределы кампуса")
sv_se: Påverkar till vetskap följande spel: * ''Mana Khemia 1'' (går "bortom behörighet")
th_th: ทราบว่าส่งผลต่อเกมต่อไปนี้: * Mana Khemia 1 (Going "off campus")
zh_tw: 已知影響下列遊戲： * Mana Khemia 1 離開校園（Off Campus）

source: Known to affect following games: * Test Drive Unlimited * Transformers
es_es: Se sabe que afecta a los siguientes juegos: * Test Drive Unlimited * Transformers
it_it: Ha effetto in questi giochi: * Test Drive Unlimited * Transformers
ja_jp: 以下のゲームに役立ちます： * テストドライブ アンリミテッド * Transformers
pl_pl: Znane z wpływu na następujące gry: Test Drive Unlimited Transformers
sv_se: Påverkar till vetskap följande spel: * ''Test Drive Unlimited'' * ''Transformers''
zh_tw: 已知影響下列遊戲： * 車魂：無限賽 * 變形金剛

source: Gamefixes can work around wrong emulation in some titles. They may also cause compatibility or performance issues. It's better to enable 'Automatic game fixes' at the main menu instead, and leave this page empty. ('Automatic' means: selectively use specific tested fixes for specific games)
es_es: Los arreglos para juegos son un arreglo temporal para poder emular algunos juegos. También pueden provocar problemas de compatibilidad o de rendimiento. Es mejor activar 'Arreglos para juegos automáticos' en el menú principal y dejar esta sección vacía. ('Automático' significa: utilizar de forma selectiva arreglos ya probados para juegos concretos)
it_it: I GameFix possono correggere i problemi di emulazione in alcuni giochi. Possono tuttavia causare problemi di compatibilità e di prestazioni in altri giochi. È consigliato attivare l'opzione 'GameFix automatici' nel menu 'Sistema', lasciando quindi le opzioni di questo pannello non selezionate. ('automatici' significa: utilizzo selettivo di GameFix specifici già testati per specifici giochi)
ja_jp: ゲームフィックスはいくつかのゲームタイトルでの不正なエミュレーションを修正しますが、 互換性やパフォーマンスに悪影響を及ぼすことがあります。 以下の項目は空欄のままにし、[自動ゲームフィックス]を有効にする事を推奨します。 （[自動ゲームフィックス]は特定のゲームに対しテスト済みの項目だけを適用させます）
pl_pl: Łatki do gier mogą poprawić działanie pewnych tytułów. Mogą też jednak pogorszyć działanie innych. Zaleca się zostawienie 'Automatycznych Poprawek' w głównym menu i zostawienie tej strony pustej. ('Automatyczne' znaczy: wybrane dla sprawdzonych gier, którym poprawia wydajność/błędy)
ru_ru: Определенные игровые хаки исправляют ошибки эмуляции в определенных играх, однако почти всегда вызывают ошибки и проблемы в других. При смене игры вам необходимо отключить хаки вручную (если какие-либо их них были включены).
sv_se: Spelfixar kan åtgärda felaktig emulering för vissa titlar. De kan dock orsaka förenlighets- och/eller prestandaproblem. Ni får stänga av Spelfixar egenhändigt när Ni byter spel. Det är i allmänhet bättre att spärra denna tillämpning, och att möjliggöra ''Automatiska Spelfixar'' i Huvudmenyn (''Automatiska'' innebär: Tillämpar särskilt utvalda och beprövade lösningar för särskilda spel).
th_th: การแก้ปัญหาเกมสามารถทำงานประมาณการจำลองที่ไม่ถูกต้องได้ในบางเรื่อง มันอาจจะทำให้เกิดปัญหาการไม่เข้ากันและปัญหาสมรรถนะ น่าจะดีกว่าถ้าใช้ 'การแก้ปัญหาเกมอัตโนมัติ' ที่เมนูหลักแทน และปล่อยหน้านี้ให้ว่างไว้ ('อัตโนมัติ' หมายถึง: การเลือกใช้วิธีการแก้ปัญหาเกมที่ผ่านการทดสอบแล้วและจำเพาะเจาะจงต่อเกมนั้น ๆ)
zh_tw: 因為預設勾選『 主選單 -> 檔案 -> 自動使用遊戲修正 』，在運行相應的遊戲時會自動套用相應的遊戲修正， 所以不推薦手動設定遊戲修正。 遊戲修正能夠修復在一些遊戲裡不正確的模擬。但會引起其他遊戲出現相容性或效能問題。 如果是手動設定遊戲修正，變更所玩的遊戲後，您需要手動關閉已啟用的遊戲修正、或乾脆關閉手動設定遊戲修正。

source: You are about to delete the formatted memory card '%s'. All data on this card will be lost! Are you absolutely and quite positively sure?
es_es: Vas a eliminar la tarjeta de memoria formateada '%s'. ¡Se perderán todos los datos de esta tarjeta! ¿Estás total y completamente seguro?
it_it: Stai per cancellare la memory card formattata '%s'. Tutti i dati di questa scheda saranno perduti! Sei assolutamente e positivamente sicuro?
ja_jp: フォーマットされたメモリーカード[%s]を削除しようとしています。 メモリーカードのデータは全て失われます。本当に削除してもよろしいですか？
pl_pl: Chcesz usunąć sformatowaną kartę pamięci '%s'. Wszystkie dane na tej karcie będą utracone! Czy jesteś pewien?
sv_se: Ni är på väg att kassera det formaterade Minneskortet '%s' . All data på detta kort kommer att förloras! Är Ni helt säker?
th_th: คุณกำลังจะลบการ์ดความจำที่ฟอร์แมตแล้ว '%s' ข้อมูลทั้งหมดบนการ์ดนี้จะหายไป! คุณแน่ใจอย่างถ่องแท้แล้วหรือไม่?

source: Failed: Duplicate is only allowed to an empty PS2-Port or to the file system.
es_es: Error: Sólo se permite duplicar a un puerto vacío de PS2 o al sistema de archivos.
it_it: Fallita: La copia è permessa solamente verso una Porta-PS2 non occupata o verso il file system.
ja_jp: コピーに失敗しました。コピーは空のPS2ポート又はファイルシステムに対してのみ許可されています。
pl_pl: Porażka: Sklonować możesz tylko do pustego slotu PS2 lub na dysk do wybranego katalogu.
ru_ru: Облом: Дубликация разершена только на пустой PS2-порт или на файловую систему
sv_se: Misslyckades: Dubblering är endast tillåtet till en tom PS2-sockel, eller till ett filsystem.
th_th: ล้มเหลว: การทำสำเนาซ้ำอนุญาตเฉพาะสู่พอร์ต-PS2 ที่ว่าง หรือสู่ระบบไฟล์
zh_tw: 失敗：僅允許建立副本至空的記憶卡插口或檔案系統。

source: Failed: Destination memory card '%s' is in use.
es_es: Error: La tarjeta de memoria de destino '%s' está siendo utilizada.
it_it: Fallita! La memory card di destinazione '%s' è in uso
ja_jp: コピーに失敗しました。コピー先のメモリーカード[%s]は使用中です。
pl_pl: Porażka: Docelowa Karta Pamięci '%s' w użyciu.
sv_se: Misslyckades: MålMinneskortet '%s' används för närvarande.
th_th: ล้มเหลว: การ์ดความจำปลายทาง '%s' กำลังถูกใช้อยู่

source: Please select your preferred default location for PCSX2 user-level documents below (includes memory cards, screenshots, settings, and savestates). These folder locations can be overridden at any time using the Plugin/BIOS Selector panel.
es_es: Selecciona tu ubicación preferida para los documentos de usuario de PCSX2. (Incluye tarjetas de memoria, capturas de pantalla, configuración y guardados rápidos) Las carpetas seleccionadas pueden cambiarse en cualquier momento en el panel de ajustes generales.
ja_jp: PCSX2がユーザーレベルドキュメントを保存するディレクトリーを指定して下さい （メモリーカード、スクリーンショット、各種設定、セーブステート） 保存場所はそれぞれの設定画面でいつでも変更する事ができます。
sv_se: Välj Ert föredragna mål för PCSX2's AnvändarnivåDokument nedanför (innefattar Minneskort, Skärmbilder, Inställningar, & Sparpunkter). Detta kan Ni ändra närsomhelst genom dialogen SystemInställningar.

source: You can change the preferred default location for PCSX2 user-level documents here (includes memory cards, screenshots, settings, and savestates). This option only affects Standard Paths which are set to use the installation default value.
es_es: Puedes cambiar la ubicación preferida para los documentos de usuario de PCSX2 aquí: (incluye tarjetas de memoria, capturas de pantalla, configuración y guardados rápidos) Esta opción sólo afecta a las carpetas estándar, que se utilizarán según la configuración de instalación predeterminada.
it_it: Puoi cambiare il percorso predefinito dei file utente di PCSX2 in questa sezione (sono incluse memory card, screenshot, impostazioni e salvataggi di stato). Questa opzione ha effetto solo sui percorsi standard che sono impostati per utilizzare il valore predefinito d'installazione.
ja_jp: PCSX2がユーザーレベルドキュメントを保存するディレクトリーを変更する事ができます （メモリーカード、スクリーンショット、各種設定、セーブステート）。 インストール時のディレクトリを標準ディレクトリとして指定するものにのみ効果があります。
pl_pl: Tutaj możesz zmienić preferowaną lokację dla plików PCSX2. (w skład wchodzą karty pamięci, zapisane obrazki, ustawienia oraz zapisy gier) Ta opcja zmienia tylko ścieżki ustawione podczas instalacji jako standardowe.
ru_ru: Данная опция позволит вам изменить папку, где PCSX2 будет сохранять ваши пользовательские данные (настройки, карты памяти, быстрые сохранения, скриншоты и т.д.). Произведенные изменения затронут только те стандартные папки, у которых стоит галочка "Использовать настройки по умолчанию".
sv_se: Ni kan ändra det föredragna förvalsmålet för PCSX2's AnvändarnivåDokument här (innefattar Minneskort, Skärmbilder, Inställningar, & Sparpunkter). Detta påverkar bara StandardSökvägarna, vilka ställs in för att använda InstallationsFörvalen.
th_th: คุณสามารถเปลี่ยนการตั้งค่าของที่ตั้งที่ชอบเป็นค่าตั้งต้น สำหรับเอกสารระดับผู้ใช้ PCSX2 ได้ที่นี่ (รวมทั้งการ์ดความจำ, ภาพหน้าจอ, การตั้งค่า และ บันทึกสถานภาพ) ตัวเลือกนี้จะมีผลเฉพาะเส้นทางมาตรฐานที่ตั้งค่าไว้ให้ใช้ค่าตั้งตั้นจากการติดตั้ง
zh_tw: 您能夠在這裡變更首選的預設位置，用於儲存 PCSX2 使用者層級的檔案。 （包括：記憶卡、遊戲擷圖、設定檔、即時存檔） 本選項僅影響被設定為使用安裝時預設值的標準路徑。
