Repository: RPCS3/rpcs3
Catalog: locales/*/pcsx2_Iconized.po
Languages: es_es, it_it, ja_jp, pl_pl, ru_ru, sv_se, th_th, zh_tw

source: NTFS compression is built-in, fast, and completely reliable; and typically compresses memory cards very well (this option is highly recommended).
es_es: La compresión NTFS está integrada, es rápida y completamente fiable, y suele comprimir muy bien las tarjetas de memoria (opción muy recomendada).
it_it: La compressione NTFS è integrata, veloce e completamente affidabile. Solitamente comprime le memory card molto bene (questa opzione è vivamente consigliata).
ja_jp: NTFS圧縮は内蔵された機能で完全に信頼できる高速な圧縮方法です。 メモリーカードの圧縮に優れています。（このオプションは強くお勧めします）
pl_pl: Kompresja NTFS wbudowana, szybka i pewna; zwykle kompresuje karty pamięci bardzo dobrze. (ta opcja jest bardzo zalecana)
ru_ru: Режим NTFS-компрессии быстр, надежен и нативен для Windows. Весьма неплохое сжатие файлов карт памяти ставит его в один ряд с другими рекомендуемыми настройками.
sv_se: NTFS-komprimering är inbyggt, snabbt, och helt tillförlitligt; det komprimerar vanligtvis Minneskort mycket bra (denna tillämpning Anrådes tydligt).
th_th: การบีบอัดแบบ NTFS เป็นโครงสร้างภายใน รวดเร็ว เชื่อถือได้ และจะบีบอัดการ์ดความจำได้ดีมาก (ขอแนะนำตัวเลือกนี้อย่างยิ่ง)
zh_tw: NTFS 壓縮是內建的，速度快，而且完全可靠； 在記憶卡的壓縮上，表現非常好。（強烈推薦）

source: Avoids memory card corruption by forcing games to re-index card contents after loading from savestates. May not be compatible with all games (Guitar Hero).
es_es: Evita que se dañe la tarjeta de memoria forzando a los juegos a rehacer el índice de los contenidos de la tarjeta tras cargar un guardado rápido. Puede no ser compatible con todos los juegos (Guitar Hero).
it_it: Consente di evitare la corruzione delle memory card forzando i giochi a reindicizzare il contenuto della scheda dopo il caricamento di un salvataggio di stato. Potrebbe non essere compatibile con tutti i giochi (Guitar Hero).
ja_jp: セーブステートをロードした際にメモリーカードデータの再インデックスをゲームに強制する事によって、 メモリーカードデータの破壊を回避します。全てのゲームに互換性があるわけではありません（ギターヒーロー）。
pl_pl: Unika uszkodzenia kart pamięci poprzez przeindexowanie zawartości po wgraniu zapisu gry. Może nie być kompatybilne ze wszystkimi grami (np. Guitar Hero).
ru_ru: Позволяет избежать возможной порчи вирутальных карты памяти при использовании быстрых сохранений. Сразу после загрузки оного, эмулятор "заставит" игру перечитать содержимое карты. Данный режим несоместим с некоторыми играми (Guitar Hero 4).
sv_se: Undviker förstörelse av Minneskort genom att tvinga spel att återindexera kortinnehåll efter att ha laddat Sparpunkt. Måhända inte förenligt med alla spel (''Guitar Hero'').
th_th: หลีกเลี่ยงการเสียของการ์ดความจำ โดยบังคับเกมให้ทำดัชนีเนื้อหาการ์ด หลังจากการโหลดจากบันทึกสถานภาพ อาจไม่เข้ากันกับทุกเกม (Guitar Hero)
zh_tw: 讀取即時存檔之後，透過強行讓遊戲重新索引記憶卡的內容，避免記憶卡損壞。 可能無法和所有遊戲都相容（已知「吉他英雄」不相容）。

source: The thread '%s' is not responding. It could be deadlocked, or it might just be running *really* slowly.
es_es: El hilo '%s' no responde. Podría haber dejado de funcionar, o simplemente se ejecute *muy* lentamente.
it_it: Il thread '%s' non risponde. Potrebbe essere bloccato o essere in esecuzione in maniera *veramente* molto lenta.
ja_jp: %sスレッドの応答がありません。デッドロック状態か、 「非常に低速」で動作している可能性があります。
pl_pl: Wątek '%s' nie odpowiada. Mógł się zawiesić lub po prostu strasznie się ślimaczy.
ru_ru: Нет ответа от потока '%s'. Возможно он завис или работет *очень* медленно.
sv_se: Tråden ''%s'' svarar inte. Den kan ha gått i baklås, eller kör kanske bara *väldigt* långsamt.
th_th: สายงาน '%s' ไม่ตอบสนอง มันอาจหยุดชะงักหรือ อาจจะกำลังรันแบบช้ามาก*จริง ๆ*
zh_tw: 執行緒【%s】停止回應。 可能是死當，或可能僅僅是執行速度「極」慢。

source: Warning! You are running PCSX2 with command line options that override your configured settings. These command line options will not be reflected in the Settings dialog, and will be disabled if you apply any changes here.
es_es: ¡Aviso! Estás ejecutando PCSX2 con opciones de línea de comandso que se saltarán tu configuración actual. Estas opciones de línea de comandos no se mostrarán en la ventana de configuración, y se desactivarán si realizas cambios aquí.
it_it: Attenzione! Stai eseguendo PCSX2 con le opzioni da riga di comando che sovrascrivono le impostazioni configurate. Le opzioni da riga di comando non saranno mostrate nella finestra delle impostazioni, e saranno disabilitate se applicherai qualche modifica.
ja_jp: 警告：通常の設定を無効化するコマンドラインでPCSX2を実行しています。コマンドラインで変更されたオプションは設定ダイアログに反映されず、ここで設定を変更しても無効化されます。
pl_pl: Uwaga! Uruchomiłeś PCSX2 z opcją lini komend nadpisującą zapisane ustawienia. Te opcje nie będą pokazane w opcjach ustawień, a jeśli zatwierdzisz jakiekolwiek zmiany w tych ostatnich, opcje lini komend zostaną wyłączone.
ru_ru: Осторожно! PCSX2 был запущен с опцией командной строки, которая замещает некоторые опции которые были определены до этого. Эти опции не будут отражены на панели, и будут отключены когда здесь будут применины какие-либо изменения.
sv_se: Varning! Ni tillämpar PCSX2 med InstruktionsMöjligheter som åsidosätter Era KonfigurationsInställningar. Detta åskådliggörs inte i InställningsDialogen, och kommer att spärras om Ni tillämpar några förändringar här.
th_th: คำเตือน! คุณกำลังรัน PCSX2 ด้วยตัวเลือก command line ที่เอาชนะการตั้งค่าที่คุณกำหนด ตัวเลือก command line นี้ จะไม่ถูกแสดงให้เห็นในกล่องโต้ตอบการตั้งค่า และจะไม่ถูกใช้งาน ถ้าคุณใช้การเปลี่ยนแปลงใด ๆ ที่นี่
zh_tw: 警告！您正在從覆寫現有設定的命令列選項執行 PCSX2。 這些命令列選項不會反映到設定視窗中，並且會被停用。 如果您在這裡套用任何變更。

source: Warning! You are running PCSX2 with command line options that override your configured plugin and/or folder settings. These command line options will not be reflected in the settings dialog, and will be disabled when you apply settings changes here.
es_es: ¡Aviso! Estás ejecutando PCSX2 con opciones de línea de comandso que se saltarán tu configuración de plugins y/o de carpetas actual. Estas opciones de línea de comandos no se mostrarán en la ventana de configuración, y se desactivarán si realizas cambios aquí.
it_it: Attenzione! Stai eseguendo PCSX2 con le opzioni da riga di comando che sovrascrivono le impostazioni dei plugin e/o le cartelle configurate. Le opzioni da riga di comando non saranno mostrate nella finestra delle impostazioni, e saranno disabilitate se applicherai qualche modifica.
ja_jp: 警告：通常のプラグイン・フォルダー設定を無効化するコマンドラインでPCSX2を実行しています。コマンドラインで変更されたオプションは設定ダイアログに反映されず、ここで設定を変更しても無効化されます。
pl_pl: Uwaga! Uruchomiłeś PCSX2 z opcją lini komend nadpisującą zapisane ustawienia wtyczek lub katalogów. Te opcje nie będą pokazane w opcjach ustawień, a jeśli zatwierdzisz jakiekolwiek zmiany w tych ostatnich, opcje lini komend zostaną wyłączone.
ru_ru: Осторожно! PCSX2 был запущен с опцией командной строки, которая замещает настройки ваших плагинов и папок . Эти настройки не будут отражены на панели, и будут отключены когда здесь будут применины какие-либо изменения.
sv_se: Varning! Ni tillämpar PCSX2 med InstruktionsMöjligheter som åsidosätter Era Insticks- och/eller MappKonfigurations- Inställningar. Detta åskådliggörs inte i InställningsDialogen, och kommer att spärras om Ni tillämpar InställningsFörändringar här.
th_th: คำเตือน! คุณกำลังรัน PCSX2 ด้วยตัวเลือก command line ที่เอาชนะการตั้งค่าปลั๊กอิน และ/หรือโฟลเดอร์ที่คุณกำหนด ตัวเลือก command line นี้จะไม่ถูกแสดงให้เห็นในกล่องโต้ตอบการตั้งค่า และจะไม่ถูกใช้งาน ถ้าคุณใช้การเปลี่ยนแปลงใด ๆ ที่นี่
zh_tw: 警告！您正在從覆寫現有插件 / 資料夾設定的命令列選項執行 PCSX2。 這些命令列選項不會反映到設定視窗中，並且會被停用。 當您在這裡套用變更時。

source: The Presets apply speed hacks, some recompiler options and some game fixes known to boost speed. Known important game fixes will be applied automatically. Presets info: 1 - The most accurate emulation but also the slowest. 3 --> Tries to balance speed with compatibility. 4 - Some more aggressive hacks. 6 - Too many hacks which will probably slow down most games.
es_es: Los preajustes aplican arreglos de velocidad, opciones del recompilador y algunos arreglos de juegos conocidos para aumentar la velocidad. Los arreglos para juegos más importantes conocidos se aplicarán de forma automática. Información de los preajustes: 1 - La emulación más precisa, pero también la más lenta. 3 --> Intenta equilibrar la velocidad con la compatibilidad. 4 - Utiliza unos arreglos más agresivos. 6 - Demasiados arreglos que probablemente ralenticen a la mayoría de los juegos.
it_it: Le Preimpostazioni applicano SpeedHack, alcune opzioni dei ricompilatori ed alcuni GameFix per aumentare la velocità. Importanti GameFix noti saranno applicati automaticamente. Informazioni sulle Preimpostazioni: 1 - L'emulazione più accurata ma anche la più lenta. 3 --> Prova a bilanciare la velocità con la compatibilità. 4 - Alcuni hack più aggressivi. 6 - Troppi hack che probabilmente rallenteranno la maggior parte dei giochi.
ja_jp: プリセットは各種スピードハック、リコンパイラー設定及び速度を向上させるゲームフィックスを適用させます。 既知のゲームフィックスは自動的に適用されます。 プリセットについて： 1 - 最も高精度なエミュレーションですが、最も低速です。 3 --> 速度と互換性のバランス型。 4 - 能動的なハックを付加します。 6 - ハック数が多すぎてほとんどのゲームでは遅くなります。
pl_pl: Predefiniowane ustawienia dotyczą poprawek i łatek poprawiających prędkość. Znane poprawki do gier zostaną użyte. Szczegółowa Informacja: 1 - Najpewniejsza emulacja, ale i nasłabsza. 3 - Próba wyważenia prędkości i kompatybilności. 4 - Bardziej agresywne sztuczki. 6 - Zbyt wiele łatek, zapewne nastąpi duże spowolnienie w większości gier.
ru_ru: При выборе предварительных настроек будут выбраны speed-хаки, несколько опций рекомпилятора и некоторые исправления которые могут увеличить производительность. Важные исправления для игр будут применяться автоматически. Варианты предварительных настроек: 1 -> Самая медленная, но и самая точная эмуляция. 3 -> Попытка сбалансировать скорость с совместимостью. 4 -> Немного более агрессивные хаки. 6 -> Как можно больше хаков, однако это скорее всего замедлит большинство игр.
sv_se: Förinställningarna tillämpar Uppsnabbningshackar, några omkompilerarfunktioner, och en del Spelfixar som till vetskap ökar farten. Spelfixar som till vetskap är viktiga (''Patchar'') tillämpas automatiskt. Förinställningsinfo: 1 - Det riktigaste emuleringen, men också den långsammaste. 3 --> Försöker balansera hastighet med förenlighet. 4 - Några mer aggresiva fixar. 6 - För många fixar kommer förmodligen att sakta ner de flesta spel.
th_th: ค่าที่ตั้งล่วงหน้า จะใช้ speedhacks, ตัวเลือกรีคอมไพเลอร์บางตัว และบางวิธีแก้ปัญหาเกมที่ทราบ เพื่อเพิ่มความเร็ว วิธีแก้ปัญหาเกมที่สำคัญและทราบแล้ว จะถูกใช้โดยอัตโนมัติ ข้อมูลค่าที่ตั้งล่วงหน้า: 1 - การจำลองที่ถูกต้องที่สุด แต่ก็ช้าที่สุดด้วย 3 --> พยายามสร้างสมดุลย์ของความเร็วและความเข้ากัน 4 - บางแฮ็คที่รุนแรงขึ้น 6 - แฮ็คที่มากเกินไปอาจจะทำให้เกมช้าลงได้
zh_tw: 1 - 最準確的模擬、速度最慢。 3 --> 嘗試在遊戲速度和相容性之間取得平衡。 4 - 一些更加激進的速度駭客、模擬器選項。 6 - 非常多的速度駭客，可能會降低大多數遊戲的遊戲速度。

source: The Presets apply speed hacks, some recompiler options and some game fixes known to boost speed. Known important game fixes will be applied automatically. --> Uncheck to modify settings manually (with current preset as base)
es_es: Los preajustes aplican arreglos de velocidad, opciones del recompilador y algunos arreglos de juegos conocidos para aumentar la velocidad. Los arreglos para juegos más importantes conocidos se aplicarán de forma automática. --> Desactivar esta opción para modificar los ajustes a mano (utilizando como base el preajuste actual).
it_it: Le Preimpostazioni applicano SpeedHack, alcune opzioni dei ricompilatori ed alcuni GameFix per aumentare la velocità. Importanti GameFix noti saranno applicati automaticamente. --> Deseleziona per modificare automaticamente le impostazioni (utilizzando la Preimpostazione corrente come base)
ja_jp: プリセットは各種スピードハック、リコンパイラー設定及び速度を向上させるゲームフィックスを適用させます。 既知のゲームフィックスは自動的に適用されます。 チェックをはずすと現在のプリセットを基に手動で設定を変更できます。
pl_pl: Preconfigurowane ustawienia zawierają poprawki, łatki i opcje rekompilatora poprawiające prędkość emulacji. Ważne poprawki znane z poprawiania gier, będą zaaplikowane automatycznie. --> Odhacz by zmienić opcje samodzielnie (z obecnym ustawieniem za podstawę).
ru_ru: При выборе предварительных настроек будут использованы speed-хаки, несколько опций рекомпилятора и некоторые исправления которые могут увеличить производительность. Важные исправления для игр будут применяться автоматически. -> Отмените выделение для ручной модификации настроек (с пред-настройками как основой).
sv_se: Förinställningarna tillämpar Uppsnabbningshackar, några omkompilerarfunktioner, och en del Spelfixar som till vetskap ökar farten. Spelfixar som till vetskap är viktiga (''Patchar'') tillämpas automatiskt. --> Hav avmarkerad för att ändra Inställningarna egenhändigt (med nuvarande inställningar som bas).
th_th: ค่าที่ตั้งล่วงหน้า จะใช้ speedhacks, ตัวเลือกรีคอมไพเลอร์บางตัว และบางวิธีแก้ปัญหาเกมที่ทราบ เพื่อเพิ่มความเร็ว วิธีแก้ปัญหาเกมที่สำคัญและทราบแล้ว จะถูกใช้โดยอัตโนมัติ --> เอาเครื่องหมายออก เพื่อปรับเปลี่ยนการตั้งค่าด้วยตนเอง (โดยมีค่าที่ตั้งล่วงหน้าเป็นฐาน)"
zh_tw: 套用速度駭客、一些反編譯選項、一些已知加快遊戲速度的遊戲修正。 已知重要的遊戲修正（補丁）會自動套用。 --> 當取消勾選時，可以手動變更模擬器設定（基於當前滑桿所選擇的預先定義的設置）

source: This action will reset the existing PS2 virtual machine state; all current progress will be lost. Are you sure?
es_es: Esta acción reiniciará el estado actual de la máquina virtual de PS2, y se perderán todos los progresos no guardados. ¿Seguro que quieres continuar?
it_it: Questa azione resetterà lo stato attuale della macchina virtuale PS2 e tutti i progressi correnti saranno perduti. Sei sicuro?
ja_jp: この操作は既存の仮想マシンをリセットします。 進行中の全ての作業が失われます。本当にリセットしてもよろしいですか？
pl_pl: Ta akcja zresetuje istniejący stan virtualnej maszyny PS2; Dotychczasowy stan gry zostanie utracony. Jesteś pewien?
ru_ru: Данная операция перезапустит вирутальную машину PS2. Все несохраненные данные будут потеряны. Хотите продолжить?
sv_se: Detta kommer att återställa det befintliga PS2 VM-tillståndet; alla nuvarande framsteg kommer att gå förlorade. Är Ni säker?
th_th: การกระทำนี้ จะรีเซ็ตสถานภาพเครื่องเสมือน PS2 ที่มีอยู่แล้วใหม่ ความคืบหน้าในปัจจุบันจะสูญหายไป คุณแน่ใจหรือไม่?"
zh_tw: 重置當前的 PS2 虛擬機狀態； 所有當前的遊戲進展將會丟失。您確定嗎？

source: This command clears %s settings and allows you to re-run the First-Time Wizard. You will need to manually restart %s after this operation. WARNING!! Click OK to delete *ALL* settings for %s and force-close the app, losing any current emulation progress. Are you absolutely sure? (note: settings for plugins are unaffected)
es_es: Esta opción elimina la configuración de %s y te permite volver a ejecutar el asistente inicial. Tendrás que reiniciar de forma manual %s tras esta operación. ¡¡AVISO!! Pulsa en Aceptar para borrar *TODA* la configuración de %s y forzar el cierre de la aplicación, perdiendo todo el progreso hecho en la emulación. ¿Estás completamente seguro? (Nota: la configuración de los plugins no se verá afectada)
it_it: Questo comando cancella le impostazioni di %s e permette di eseguire nuovamente la Procedura Guidata del primo avvio. Sarà necessario riavviare %s manualmente dopo questa operazione. ATTENZIONE!! Fai Clic su OK per cancellare *TUTTE* le impostazioni di %s e forzare la chiusura dell'applicazione, includendo la perdita dello stato attuale dell'emulazione. Sei davvero sicuro? (nota: le impostazioni dei singoli plugin non saranno cancellate)
ja_jp: この操作は%sの設定を全て削除してリセットします。 次回起動時に初期設定ウィザードを再実行させる事ができます。 この操作を実行した後に手動で%sを再起動する必要があります。 警告： OKをクリックすると%s設定を「全て削除」します。 プログラムは強制終了し、進行中のエミュレーション作業は失われます。 本当によろしいですか？ （注意： プラグインの設定に影響はありません）
pl_pl: Ta komenda wyczyści ustawienia %s i pozwoli na przywrócenie Pomocnika Konfiguraci. Będziesz musiał ręcznie włączyć %s ponownie po tej operacji. UWAGA!! Naciśnij OK aby wykasować WSZYSTKIE ustawienia dla %s i zamknąć aplikację, tracąc obecny stan emulacji. Czy jesteś ABSOLUTNIE pewien, że tego chcesz? (Informacja: Ustawienia wtyczek nie będą naruszone)
sv_se: Detta rensar %s-Inställningarna och låter Er att återköra KonfigurationsDialogen. Ni får återstarta %s egenhändigt efter detta. VARNING! Tryck ''Vidare'' för att rensa *ALLA* Inställningar för %s och tvångstänga programet, med följd att alla nuvarande emuleringsframsteg går förlorade. Bemärk: Inställningar för InsticksProgram påverkas ej. Är Ni helt säker?
th_th: คำสั่งนี้จะล้างการตั้งค่า %s และอนุญาตให้คุณรันตัวช่วยครั้งแรก (wizard) คุณจำเป็นต้อง เริ่มต้น %s ใหม่ หลังจากการกระทำนี้ คำเตือน!! คลิก ตกลง เพื่อลบการตั้งค่า*ทั้งหมด*สำหรับ %s และบังคับให้ปิดโปรแกรม ความคืบหน้าการจำลองจะสูญหาย คุณแน่ใจจริง ๆ หรือไม่? (หมายเหตุ: การตั้งค่าสำหรับปลั๊กอินไม่ได้รับผลกระทบ)
zh_tw: 清除 %s 的設定，並且允許您重新執行首次執行精靈。 本操作完成之後，您需要手動重新啟動 %s。 警告！！按【確定】刪除 %s 的全部設定，並會強行關閉 PCSX2，丟失任何當前的遊戲進展。您真的確定嗎？ （注意：各個插件自身的設定不受影響）

source: The PS2-slot %d has been automatically disabled. You can correct the problem and re-enable it at any time using Config:Memory cards from the main menu.
es_es: La ranura de PS2 %d ha sido desactivada automáticamente. Puedes resolver el problema y volver a activarla en cualquier momento dirigiéndote a Ajustes -> Tarjetas de memoria en el menú principal.
it_it: Lo slot PS2 %d è stato automaticamente disabilitato. Si può correggere il problema e riabilitarlo utilizzando Configurazione -> Memory Card dai menù principali.
ja_jp: PS2スロット[%d]は自動的に無効にされました。この問題を解決するには メインメニューから [設定→メモリーカード] で再度有効化して下さい。
pl_pl: Slot nr %d karty pamięci PS2 został wyłączony. Możesz poprawić problem i włączyć slot ponownie używając Konfiguracji - Karty Pamięci z głównego menu.
ru_ru: Карта памяти в слоте %d была автоматически отключена. После того, как вы исправите проблему, вы можете включить ее опять в окне управления картами памяти: Настройки -> Настройки карт памя
sv_se: PS2-sockeln %d har blivit automatiskt spärrad. Ni kan åtgärda problemet och återmöjliggöra det när som helst genom ''Konfig > Minneskort'' i Huvudmenyn.
th_th: สล็อต-PS2 %d ไม่ถูกใช้งานอัตโนมัติ คุณสามารถแก้ไขปัญหา และใช้งานมันใหม่ตอนไหนก็ได้โดยใช้การ กำหนดค่า:การ์ดความจำ จากเมนูหลัก
zh_tw: 插槽 %d 的記憶卡已經被自動停用。 您可以在任何時候，透過「PCSX2 主選單 => 設定 => 記憶卡」糾正這一問題並重新啟用記憶卡。

source: Please select a valid BIOS. If you are unable to make a valid selection then press Cancel to close the Configuration panel.
es_es: Selecciona una BIOS válida. Si no puedes seleccionar una opción válida, pulsa en Cancelar para cerrar el panel de configuración.
it_it: Per favore seleziona un BIOS valido. Se non è possibile effettuare una selezione valida, premi Annulla per chiudere il pannello di configurazione.
ja_jp: 有効なBIOSイメージファイルを選択して下さい。 選択できない場合はキャンセルを押して設定パネルを閉じてください。
pl_pl: Proszę użyć poprawnego BIOSu. Jeśli takiego nie posiadasz, naciśnij 'Anuluj' aby zamknąć panel konfiguracji.
ru_ru: Для продолжения работы вам необходимо выбрать образ BIOS'а. Если вы не уверены в своем выборе, нажмите Cancel дабы закрыть окно настроек без применения изменений.
sv_se: Välj ett giltligt BIOS. Är Ni oförmögen att göra detta så tryck ''Avbryt'' för att stänga KonfigurationsDialogen.
th_th: โปรดเลือกไบออสที่ถูกต้อง ถ้าคุณไม่สามารถทำการเลือกที่ถูกต้องได้ จงกด ยกเลิก เพื่อปิดผังการกำหนดค่า
zh_tw: 請選擇一個有效的 BIOS。 若您無法作出有效的選擇，那就按【取消】關閉設定視窗。

source: Notice: Most games are fine with the default options.
es_es: Nota: La mayoría de los juegos funcionan bien con las opciones predeterminadas.
it_it: Avviso: La maggior parte dei giochi funzionano bene con le impostazioni predefinite.
ja_jp: メモ：ほとんどのゲームはデフォルト設定のままで動作します。
pl_pl: Uwaga: Większość gier chodzi dobrze na standardowych ustawieniach.
ru_ru: Примечание: большинство игр хорошо работают со стандартными настройками
sv_se: EE = Emotion Engine = Rörelse Motor = PS2 CPU'n IOP = Input/Output Processor = In/Ut Processor Bemärk: De flesta spel har det fint med FörvalsSättningarna.
th_th: แจ้ง: ค่าตัวเลือกตั้งต้นมักจะดีกับเกมส่วนใหญ่
zh_tw: 注意：大多數遊戲只需使用預設設定即可。

source: Notice: Most games are fine with the default options.
es_es: Nota: La mayoría de los juegos funcionan bien con las opciones predeterminadas.
it_it: Avviso: La maggior parte dei giochi funzionano bene con le impostazioni predefinite.
ja_jp: メモ：ほとんどのゲームはデフォルト設定のままで動作します。
pl_pl: Uwaga: Większość gier chodzi dobrze na standardowych ustawieniach.
ru_ru: Примечание: большинство игр хорошо работают со стандартными настройками
sv_se: VM = Virtual Machine = Virtuell Maskin VU = Vector Unit = Vektor Enhet Bemärk: De flesta spel har det fint med FörvalsSättningarna.
th_th: แจ้ง: ค่าตัวเลือกตั้งต้นมักจะดีกับเกมส่วนใหญ่
zh_tw: 注意：大多數遊戲只需使用預設設定即可。

source: The specified path/directory does not exist. Would you like to create it?
es_es: La carpeta indicada no existe. ¿Quieres crearla?
it_it: Il percorso/cartella specificato non esiste. Desideri crearlo?
ja_jp: 指定されたディレクトリーは存在しません。作成しますか？
pl_pl: Wybrana ścieżka/katalog nie istnieją. Czy chcesz go utworzyć?
ru_ru: Указаные путь/папка не существуют. Желаете создать их?
sv_se: Den angivna sökvägen/katalogen finns ej. Vill Ni skapa den?
th_th: ไม่มีเส้นทาง/ไดเรกทอรี่ที่ระบุ คุณต้องการสร้างมันหรือไม่?
zh_tw: 指定的路徑 / 資料夾不存在。您想要新增嗎？

source: When checked this folder will automatically reflect the default associated with PCSX2's current usermode setting.
es_es: Si se activa esta opción, la carpeta se asignará automáticamente al ajuste actual de modo de usuario de PCSX2 asociado.
it_it: Se spuntata, l'impostazione della cartella rifletterà automaticamente l'impostazione predefinita associata alla modalità utente scelta in PCSX2.
ja_jp: チェックを入れるとこのフォルダーは現在のPCSX2のユーザーモード設定に関するデフォルトを自動的に反映されます。
pl_pl: Kiedy zaznaczone, ten katalog automatycznie odzwierciedla standardowy folder w ustawieniach użytkownika PCSX2.
ru_ru: Активируйте данную опцию, если желаете чтобы PCSX2 создавала соответствующие папки относительно пути указанному в настройках пользовательского режима.
sv_se: När markerad kommer denna Mapp automatiskt att fungera enligt Förvalen förknippade med PCSX2's nuvarande AnvändarInställningar.
th_th: เมื่อทำเครื่องหมาย โฟลเดอร์นี้จะแสดงค่าตั้งต้นที่เกี่ยวข้องกับการตั้งค่าโหมดผู้ใช้ปัจจุบันของ PCSX2 โดยอัตโนมัติ
zh_tw: 當勾選時，此資料夾將會自動反映與 PCSX2 當前的使用者設定所關聯的預設值。
